aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
//=============================================================================================================
#define P0INTE (*(volatile __xdata unsigned char *)0xfd00)	/* P0口中断使能寄存器  - Interrupt - Enable*/
#define P1INTE (*(volatile __xdata unsigned char *)0xfd01)	/* P1口中断使能寄存器  - Interrupt - Enable*/
#define P2INTE (*(volatile __xdata unsigned char *)0xfd02)	/* P2口中断使能寄存器  - Interrupt - Enable*/
#define P3INTE (*(volatile __xdata unsigned char *)0xfd03)	/* P3口中断使能寄存器  - Interrupt - Enable*/
#define P4INTE (*(volatile __xdata unsigned char *)0xfd04)	/* P4口中断使能寄存器  - Interrupt - Enable*/
#define P5INTE (*(volatile __xdata unsigned char *)0xfd05)	/* P5口中断使能寄存器  - Interrupt - Enable*/
#define P6INTE (*(volatile __xdata unsigned char *)0xfd06)	/* P6口中断使能寄存器  - Interrupt - Enable*/
#define P7INTE (*(volatile __xdata unsigned char *)0xfd07)	/* P7口中断使能寄存器  - Interrupt - Enable*/
#define P0INTF (*(volatile __xdata unsigned char *)0xfd10)	/* P0口中断标志寄存器  - Interrupt - Flag*/
#define P1INTF (*(volatile __xdata unsigned char *)0xfd11)	/* P1口中断标志寄存器  - Interrupt - Flag*/
#define P2INTF (*(volatile __xdata unsigned char *)0xfd12)	/* P2口中断标志寄存器  - Interrupt - Flag*/
#define P3INTF (*(volatile __xdata unsigned char *)0xfd13)	/* P3口中断标志寄存器  - Interrupt - Flag*/
#define P4INTF (*(volatile __xdata unsigned char *)0xfd14)	/* P4口中断标志寄存器  - Interrupt - Flag*/
#define P5INTF (*(volatile __xdata unsigned char *)0xfd15)	/* P5口中断标志寄存器  - Interrupt - Flag*/
#define P6INTF (*(volatile __xdata unsigned char *)0xfd16)	/* P6口中断标志寄存器  - Interrupt - Flag*/
#define P7INTF (*(volatile __xdata unsigned char *)0xfd17)	/* P7口中断标志寄存器  - Interrupt - Flag*/
#define P0IM0 (*(volatile __xdata unsigned char *)0xfd20)	/* P0口中断模式寄存器0  - Interrupt - Mode*/
#define P1IM0 (*(volatile __xdata unsigned char *)0xfd21)	/* P1口中断模式寄存器0  - Interrupt - Mode*/
#define P2IM0 (*(volatile __xdata unsigned char *)0xfd22)	/* P2口中断模式寄存器0  - Interrupt - Mode*/
#define P3IM0 (*(volatile __xdata unsigned char *)0xfd23)	/* P3口中断模式寄存器0  - Interrupt - Mode*/
#define P4IM0 (*(volatile __xdata unsigned char *)0xfd24)	/* P4口中断模式寄存器0  - Interrupt - Mode*/
#define P5IM0 (*(volatile __xdata unsigned char *)0xfd25)	/* P5口中断模式寄存器0  - Interrupt - Mode*/
#define P6IM0 (*(volatile __xdata unsigned char *)0xfd26)	/* P6口中断模式寄存器0  - Interrupt - Mode*/
#define P7IM0 (*(volatile __xdata unsigned char *)0xfd27)	/* P7口中断模式寄存器0  - Interrupt - Mode*/
#define P0IM1 (*(volatile __xdata unsigned char *)0xfd30)	/* P0口中断模式寄存器1  - Interrupt - Mode*/
#define P1IM1 (*(volatile __xdata unsigned char *)0xfd31)	/* P1口中断模式寄存器1  - Interrupt - Mode*/
#define P2IM1 (*(volatile __xdata unsigned char *)0xfd32)	/* P2口中断模式寄存器1  - Interrupt - Mode*/
#define P3IM1 (*(volatile __xdata unsigned char *)0xfd33)	/* P3口中断模式寄存器1  - Interrupt - Mode*/
#define P4IM1 (*(volatile __xdata unsigned char *)0xfd34)	/* P4口中断模式寄存器1  - Interrupt - Mode*/
#define P5IM1 (*(volatile __xdata unsigned char *)0xfd35)	/* P5口中断模式寄存器1  - Interrupt - Mode*/
#define P6IM1 (*(volatile __xdata unsigned char *)0xfd36)	/* P6口中断模式寄存器1  - Interrupt - Mode*/
#define P7IM1 (*(volatile __xdata unsigned char *)0xfd37)	/* P7口中断模式寄存器1  - Interrupt - Mode*/

#define INTE_0       0x01	/* 使能Px.0口中断功能  - Interrupt - Enable*/
#define INTE_1       0x02	/* 使能Px.1口中断功能  - Interrupt - Enable*/
#define INTE_2       0x04	/* 使能Px.2口中断功能  - Interrupt - Enable*/
#define INTE_3       0x08	/* 使能Px.3口中断功能  - Interrupt - Enable*/
#define INTE_4       0x10	/* 使能Px.4口中断功能  - Interrupt - Enable*/
#define INTE_5       0x20	/* 使能Px.5口中断功能  - Interrupt - Enable*/
#define INTE_6       0x40	/* 使能Px.6口中断功能  - Interrupt - Enable*/
#define INTE_7       0x80	/* 使能Px.7口中断功能  - Interrupt - Enable*/

#define INTF_0       0x01	/* Px.0口中断标志  - Interrupt - Flag*/
#define INTF_1       0x02	/* Px.1口中断标志  - Interrupt - Flag*/
#define INTF_2       0x04	/* Px.2口中断标志  - Interrupt - Flag*/
#define INTF_3       0x08	/* Px.3口中断标志  - Interrupt - Flag*/
#define INTF_4       0x10	/* Px.4口中断标志  - Interrupt - Flag*/
#define INTF_5       0x20	/* Px.5口中断标志  - Interrupt - Flag*/
#define INTF_6       0x40	/* Px.6口中断标志  - Interrupt - Flag*/
#define INTF_7       0x80	/* Px.7口中断标志  - Interrupt - Flag*/

#define	INT_FALL	0		/* 下降沿中断    - Interrupt*/
#define	INT_RISE	1		/* 上升沿中断    - Interrupt*/
#define	INT_LOW		2		/* 低电平中断    - Interrupt*/
#define	INT_HIGH	3		/* 高电平中断    - Interrupt*/


#define CLKSEL (*(volatile __xdata unsigned char *)0xfe00)	/* 主时钟源选择     - Clock*/
#define CKSEL (*(volatile __xdata unsigned char *)0xfe00)	/* 主时钟源选择     - Clock*/
#define CLKDIV (*(volatile __xdata unsigned char *)0xfe01)	/* 主时钟分频       - Clock*/
#define CKDIV (*(volatile __xdata unsigned char *)0xfe01)	/* 主时钟分频       - Clock*/
#define IRC24MCR (*(volatile __xdata unsigned char *)0xfe02)	/* IRC 24MHZ控制    - Control*/
#define XOSCCR (*(volatile __xdata unsigned char *)0xfe03)	/* XOSC控制         - Control*/
#define IRC32KCR (*(volatile __xdata unsigned char *)0xfe04)	/* IRC 32KHZ控制    - Control*/
#define MCLKOCR (*(volatile __xdata unsigned char *)0xfe05)	/* 主时钟输出控制寄存器   - Clock - Control*/
#define IRCDB (*(volatile __xdata unsigned char *)0xfe06)	/* 内部高速振荡器去抖控制寄存器   - Control*/

#define P0PU (*(volatile __xdata unsigned char *)0xfe10)	/* P0 3.7K Pull Up Enable  */
#define P1PU (*(volatile __xdata unsigned char *)0xfe11)	/* P1 3.7K Pull Up Enable  */
#define P2PU (*(volatile __xdata unsigned char *)0xfe12)	/* P2 3.7K Pull Up Enable  */
#define P3PU (*(volatile __xdata unsigned char *)0xfe13)	/* P3 3.7K Pull Up Enable  */
#define P4PU (*(volatile __xdata unsigned char *)0xfe14)	/* P4 3.7K Pull Up Enable  */
#define P5PU (*(volatile __xdata unsigned char *)0xfe15)	/* P5 3.7K Pull Up Enable  */
#define P6PU (*(volatile __xdata unsigned char *)0xfe16)	/* P6 3.7K Pull Up Enable  */
#define P7PU (*(volatile __xdata unsigned char *)0xfe17)	/* P7 3.7K Pull Up Enable  */

#define P0NCS (*(volatile __xdata unsigned char *)0xfe18)	/* P0 Non Schmit Trigger  0: 使能端口施密特触发功能(默认), 1: 禁止   - Port - Enable - Disable*/
#define P1NCS (*(volatile __xdata unsigned char *)0xfe19)	/* P1 Non Schmit Trigger  */
#define P2NCS (*(volatile __xdata unsigned char *)0xfe1a)	/* P2 Non Schmit Trigger  */
#define P3NCS (*(volatile __xdata unsigned char *)0xfe1b)	/* P3 Non Schmit Trigger  */
#define P4NCS (*(volatile __xdata unsigned char *)0xfe1c)	/* P4 Non Schmit Trigger  */
#define P5NCS (*(volatile __xdata unsigned char *)0xfe1d)	/* P5 Non Schmit Trigger  */
#define P6NCS (*(volatile __xdata unsigned char *)0xfe1e)	/* P6 Non Schmit Trigger  */
#define P7NCS (*(volatile __xdata unsigned char *)0xfe1f)	/* P7 Non Schmit Trigger  */

#define P0SR (*(volatile __xdata unsigned char *)0xfe20)	/* P0口电平转换速率寄存器 默认1: 普通模式, 0:高速模式  - Mode*/
#define P1SR (*(volatile __xdata unsigned char *)0xfe21)	/* P1口电平转换速率寄存器  */
#define P2SR (*(volatile __xdata unsigned char *)0xfe22)	/* P2口电平转换速率寄存器  */
#define P3SR (*(volatile __xdata unsigned char *)0xfe23)	/* P3口电平转换速率寄存器  */
#define P4SR (*(volatile __xdata unsigned char *)0xfe24)	/* P4口电平转换速率寄存器  */
#define P5SR (*(volatile __xdata unsigned char *)0xfe25)	/* P5口电平转换速率寄存器  */
#define P6SR (*(volatile __xdata unsigned char *)0xfe26)	/* P6口电平转换速率寄存器  */
#define P7SR (*(volatile __xdata unsigned char *)0xfe27)	/* P7口电平转换速率寄存器  */

#define P0DR (*(volatile __xdata unsigned char *)0xfe28)	/* P0口驱动电流控制寄存器 默认1: 普通模式, 0:大电流模式 - Mode - Control*/
#define P1DR (*(volatile __xdata unsigned char *)0xfe29)	/* P1口驱动电流控制寄存器  - Control*/
#define P2DR (*(volatile __xdata unsigned char *)0xfe2a)	/* P2口驱动电流控制寄存器  - Control*/
#define P3DR (*(volatile __xdata unsigned char *)0xfe2b)	/* P3口驱动电流控制寄存器  - Control*/
#define P4DR (*(volatile __xdata unsigned char *)0xfe2c)	/* P4口驱动电流控制寄存器  - Control*/
#define P5DR (*(volatile __xdata unsigned char *)0xfe2d)	/* P5口驱动电流控制寄存器  - Control*/
#define P6DR (*(volatile __xdata unsigned char *)0xfe2e)	/* P6口驱动电流控制寄存器  - Control*/
#define P7DR (*(volatile __xdata unsigned char *)0xfe2f)	/* P7口驱动电流控制寄存器  - Control*/

#define P0IE (*(volatile __xdata unsigned char *)0xfe30)	/* P0口输入使能控制寄存器, 1允许(默认), 0禁止  - Control - Enable - Disable*/
#define P1IE (*(volatile __xdata unsigned char *)0xfe31)	/* P1口输入使能控制寄存器  - Control - Enable*/
#define P2IE (*(volatile __xdata unsigned char *)0xfe32)	/* P2口输入使能控制寄存器  - Control - Enable*/
#define P3IE (*(volatile __xdata unsigned char *)0xfe33)	/* P3口输入使能控制寄存器  - Control - Enable*/
#define P4IE (*(volatile __xdata unsigned char *)0xfe34)	/* P4口输入使能控制寄存器  - Control - Enable*/
#define P5IE (*(volatile __xdata unsigned char *)0xfe35)	/* P5口输入使能控制寄存器  - Control - Enable*/
#define P6IE (*(volatile __xdata unsigned char *)0xfe36)	/* P6口输入使能控制寄存器  - Control - Enable*/
#define P7IE (*(volatile __xdata unsigned char *)0xfe37)	/* P7口输入使能控制寄存器  - Control - Enable*/

#define I2CCFG (*(volatile __xdata unsigned char *)0xfe80)	/* I2C配置寄存器   - Configuration - Inter-Integrated Circuit*/
#define I2CMSCR (*(volatile __xdata unsigned char *)0xfe81)	/* I2C主机控制寄存器   - Control - Inter-Integrated Circuit*/
#define I2CMSST (*(volatile __xdata unsigned char *)0xfe82)	/* I2C主机状态寄存器   - Status - Inter-Integrated Circuit*/
#define I2CSLCR (*(volatile __xdata unsigned char *)0xfe83)	/* I2C从机控制寄存器   - Control - Inter-Integrated Circuit*/
#define I2CSLST (*(volatile __xdata unsigned char *)0xfe84)	/* I2C从机状态寄存器   - Status - Inter-Integrated Circuit*/
#define I2CSLADR (*(volatile __xdata unsigned char *)0xfe85)	/* I2C从机地址寄存器   - Inter-Integrated Circuit*/
#define I2CTXD (*(volatile __xdata unsigned char *)0xfe86)	/* I2C数据发送寄存器   - Data - Inter-Integrated Circuit*/
#define I2CRXD (*(volatile __xdata unsigned char *)0xfe87)	/* I2C数据接收寄存器   - Data - Inter-Integrated Circuit*/
#define I2CMSAUX (*(volatile __xdata unsigned char *)0xfe88)	/* I2C主机辅助控制寄存器   - Control - Inter-Integrated Circuit*/

