aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
#define TM2PS (*(volatile __xdata unsigned char *)0xfea2)	/* 定时器2时钟预分频寄存器   - Timer - Clock*/
#define TM3PS (*(volatile __xdata unsigned char *)0xfea3)	/* 定时器3时钟预分频寄存器   - Timer - Clock*/
#define TM4PS (*(volatile __xdata unsigned char *)0xfea4)	/* 定时器4时钟预分频寄存器   - Timer - Clock*/
#define ADCTIM (*(volatile __xdata unsigned char *)0xfea8)	/* ADC时序控制寄存器   - Control - Analog to Digital Converter*/

// PWMSET(0xF1)控制位定义  - Bit Definitions - Control - Pulse Width Modulation
#define	ENGLBSET	0x80	/* 1: 6组PWM统一采用PWMCFG01中的PWM0的设置进行配置, 0: 各组PWM独立设置  - Configuration - Pulse Width Modulation*/
#define	PWMRST		0x40	/* 1: 复位所有XFR寄存器(但不复位SFR寄存器), 软件清零  - Reset*/
#define	ENPWM5		0x20	/* 1: 使能PWM5(PWM50~PWM54), 0: 关闭PWM5  - Enable - Pulse Width Modulation*/
#define	ENPWM4		0x10	/* 1: 使能PWM4(PWM40~PWM47), 0: 关闭PWM4  - Enable - Pulse Width Modulation*/
#define	ENPWM3		0x08	/* 1: 使能PWM3(PWM30~PWM37), 0: 关闭PWM3  - Enable - Pulse Width Modulation*/
#define	ENPWM2		0x04	/* 1: 使能PWM2(PWM20~PWM27), 0: 关闭PWM2  - Enable - Pulse Width Modulation*/
#define	ENPWM1		0x02	/* 1: 使能PWM1(PWM10~PWM17), 0: 关闭PWM1  - Enable - Pulse Width Modulation*/
#define	ENPWM0		0x01	/* 1: 使能PWM0(PWM00~PWM07), 0: 关闭PWM0  - Enable - Pulse Width Modulation*/

// PWMCFG01(0xF6)控制位定义 - Bit Definitions - Control - Pulse Width Modulation
#define	PWM1CBIF	0x80	/* 1: PWM1计数器归零中断标志位, 归零硬件就置1, 软件清零  - Interrupt - Flag - Counter - Pulse Width Modulation*/
#define	EPWM1CBI	0x40	/* 1: 使能计数器归零中断， 0: 关闭计数器归零中断  - Interrupt - Enable - Counter*/
#define	FLTPS0		0x20	/*  */
#define	PWM1CEN		0x10	/* 1: PWM1开始计数, 0: 停止计数  - Pulse Width Modulation*/
#define	PWM0CBIF	0x08	/* 1: PWM0计数器归零中断标志位, 归零硬件就置1, 软件清零  - Interrupt - Flag - Counter - Pulse Width Modulation*/
#define	EPWM0CBI	0x04	/* 1: 使能计数器归零中断， 0: 关闭计数器归零中断  - Interrupt - Enable - Counter*/
#define	ENPWM0TA	0x02	/* 1: 当PWM计数值等于PWM0TADC时, 触发ADC转换  - Pulse Width Modulation - Analog to Digital Converter*/
#define	PWM0CEN		0x01	/* 1: PWM0开始计数, 0: 停止计数  - Pulse Width Modulation*/

// PWMCFG23(0xF7)控制位定义 - Bit Definitions - Control - Pulse Width Modulation
#define	PWM3CBIF	0x80	/* 1: PWM3计数器归零中断标志位, 归零硬件就置1, 软件清零  - Interrupt - Flag - Counter - Pulse Width Modulation*/
#define	EPWM3CBI	0x40	/* 1: 使能计数器归零中断， 0: 关闭计数器归零中断  - Interrupt - Enable - Counter*/
#define	FLTPS1		0x20	/*  */
#define	PWM3CEN		0x10	/* 1: PWM3开始计数, 0: 停止计数  - Pulse Width Modulation*/
#define	PWM2CBIF	0x08	/* 1: PWM2计数器归零中断标志位, 归零硬件就置1, 软件清零  - Interrupt - Flag - Counter - Pulse Width Modulation*/
#define	EPWM2CBI	0x04	/* 1: 使能计数器归零中断， 0: 关闭计数器归零中断  - Interrupt - Enable - Counter*/
#define	ENPWM2TA	0x02	/* 1: 当PWM计数值等于PWM2TADC时, 触发ADC转换  - Pulse Width Modulation - Analog to Digital Converter*/
#define	PWM2CEN		0x01	/* 1: PWM2开始计数, 0: 停止计数  - Pulse Width Modulation*/

// PWMCFG45(0xFE)控制位定义 - Bit Definitions - Control - Pulse Width Modulation
#define	PWM5CBIF	0x80	/* 1: PWM5计数器归零中断标志位, 归零硬件就置1, 软件清零  - Interrupt - Flag - Counter - Pulse Width Modulation*/
#define	EPWM5CBI	0x40	/* 1: 使能计数器归零中断， 0: 关闭计数器归零中断  - Interrupt - Enable - Counter*/
#define	FLTPS2		0x20	/*  */
#define	PWM5CEN		0x10	/* 1: PWM5开始计数, 0: 停止计数  - Pulse Width Modulation*/
#define	PWM4CBIF	0x08	/* 1: PWM4计数器归零中断标志位, 归零硬件就置1, 软件清零  - Interrupt - Flag - Counter - Pulse Width Modulation*/
#define	EPWM4CBI	0x04	/* 1: 使能计数器归零中断， 0: 关闭计数器归零中断  - Interrupt - Enable - Counter*/
#define	ENPWM4TA	0x02	/* 1: 当PWM计数值等于PWM4TADC时, 触发ADC转换  - Pulse Width Modulation - Analog to Digital Converter*/
#define	PWM4CEN		0x01	/* 1: PWM4开始计数, 0: 停止计数  - Pulse Width Modulation*/

//PWMxIF  PWM0中断标志寄存器位定义 - Bit Definitions - Interrupt - Flag - Pulse Width Modulation
#define	C7IF	0x80	/* 1: PWMx7匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C6IF	0x40	/* 1: PWMx6匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C5IF	0x20	/* 1: PWMx5匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C4IF	0x10	/* 1: PWMx4匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C3IF	0x08	/* 1: PWMx3匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C2IF	0x04	/* 1: PWMx2匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C1IF	0x02	/* 1: PWMx1匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/
#define	C0IF	0x01	/* 1: PWMx0匹配中断标志位, 软件清零  - Interrupt - Flag - Pulse Width Modulation*/

//PWMxCKS PWM时钟选择寄存器位定义 - Bit Definitions - Clock - Pulse Width Modulation
#define	CKS_TIMER2	0x10	/* 使用定时器2溢出做PWM时钟  - Timer - Clock - Pulse Width Modulation*/
#define	CKS_1T		0
#define	CKS_2T		1
#define	CKS_3T		2
#define	CKS_4T		3
#define	CKS_5T		4
#define	CKS_6T		5
#define	CKS_7T		6
#define	CKS_8T		7
#define	CKS_9T		8
#define	CKS_10T		9
#define	CKS_11T		10
#define	CKS_12T		11
#define	CKS_13T		12
#define	CKS_14T		13
#define	CKS_15T		14
#define	CKS_16T		15

//PWMxxCR PWM通道控制寄存器位定义 - Bit Definitions - Control - Pulse Width Modulation
#define	ENO		0x80	/* 1: 允许对应引脚为PWM, 0: 对应引脚为GPIO  - Pulse Width Modulation*/
#define	INI		0x40	/* 1: 设置对应引脚初始电平为高电平, 0: 初始电平为低电平. 一旦启动PWM, 则引脚输出会受PWM控制  - Control - Pulse Width Modulation*/
#define	ENI		0x04	/* 1: 允许中断, 0: 禁止中断  - Interrupt - Disable*/
#define	ENT2I	0x02	/* 1: 允许上升沿中断, 0: 禁止上升沿中断 (T2匹配) - Interrupt - Disable*/
#define	ENT1I	0x01	/* 1: 允许下降沿中断, 0: 禁止下降沿中断 (T1匹配) - Interrupt - Disable*/
//PWMxxHLD PWM通道电平保持(强制输出)控制寄存器位定义 - Bit Definitions - Control - Pulse Width Modulation
#define	PWM_KeepHigh	0x02	/* PWM强制输出高电平  - Pulse Width Modulation*/
#define	PWM_KeepLow		0x01	/* PWM强制输出低电平  - Pulse Width Modulation*/
#define	PWM_Normal		0x00	/* PWM正常输出  - Pulse Width Modulation*/

#define PWM0C (*(volatile __xdata unsigned int *)0xff00)	/* PWM0计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM0TADC (*(volatile __xdata unsigned int *)0xff03)	/* PWM0触发ADC计数  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM00T1 (*(volatile __xdata unsigned int *)0xff10)	/* PWM00T1计数值  - Pulse Width Modulation*/
#define PWM00T2 (*(volatile __xdata unsigned int *)0xff12)	/* PWM00T2计数值  - Pulse Width Modulation*/
#define PWM01T1 (*(volatile __xdata unsigned int *)0xff18)	/* PWM01T1计数值  - Pulse Width Modulation*/
#define PWM01T2 (*(volatile __xdata unsigned int *)0xff1a)	/* PWM01T2计数值  - Pulse Width Modulation*/
#define PWM02T1 (*(volatile __xdata unsigned int *)0xff20)	/* PWM02T1计数值  - Pulse Width Modulation*/
#define PWM02T2 (*(volatile __xdata unsigned int *)0xff22)	/* PWM02T2计数值  - Pulse Width Modulation*/
#define PWM03T1 (*(volatile __xdata unsigned int *)0xff28)	/* PWM03T1计数值  - Pulse Width Modulation*/
#define PWM03T2 (*(volatile __xdata unsigned int *)0xff2a)	/* PWM03T2计数值  - Pulse Width Modulation*/
#define PWM04T1 (*(volatile __xdata unsigned int *)0xff30)	/* PWM04T1计数值  - Pulse Width Modulation*/
#define PWM04T2 (*(volatile __xdata unsigned int *)0xff32)	/* PWM04T2计数值  - Pulse Width Modulation*/
#define PWM05T1 (*(volatile __xdata unsigned int *)0xff38)	/* PWM05T1计数值  - Pulse Width Modulation*/
#define PWM05T2 (*(volatile __xdata unsigned int *)0xff3a)	/* PWM05T2计数值  - Pulse Width Modulation*/
#define PWM06T1 (*(volatile __xdata unsigned int *)0xff40)	/* PWM06T1计数值  - Pulse Width Modulation*/
#define PWM06T2 (*(volatile __xdata unsigned int *)0xff42)	/* PWM06T2计数值  - Pulse Width Modulation*/
#define PWM07T1 (*(volatile __xdata unsigned int *)0xff48)	/* PWM07T1计数值  - Pulse Width Modulation*/
#define PWM07T2 (*(volatile __xdata unsigned int *)0xff4a)	/* PWM07T2计数值  - Pulse Width Modulation*/
#define PWM1C (*(volatile __xdata unsigned int *)0xff50)	/* PWM1计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM1TADC (*(volatile __xdata unsigned int *)0xff53)	/* PWM1触发ADC计数  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM10T1 (*(volatile __xdata unsigned int *)0xff60)	/* PWM10T1计数值  - Pulse Width Modulation*/
#define PWM10T2 (*(volatile __xdata unsigned int *)0xff62)	/* PWM10T2计数值  - Pulse Width Modulation*/
#define PWM11T1 (*(volatile __xdata unsigned int *)0xff68)	/* PWM11T1计数值  - Pulse Width Modulation*/
#define PWM11T2 (*(volatile __xdata unsigned int *)0xff6a)	/* PWM11T2计数值  - Pulse Width Modulation*/
#define PWM12T1 (*(volatile __xdata unsigned int *)0xff70)	/* PWM12T1计数值  - Pulse Width Modulation*/
#define PWM12T2 (*(volatile __xdata unsigned int *)0xff72)	/* PWM12T2计数值  - Pulse Width Modulation*/
#define PWM13T1 (*(volatile __xdata unsigned int *)0xff78)	/* PWM13T1计数值  - Pulse Width Modulation*/
#define PWM13T2 (*(volatile __xdata unsigned int *)0xff7a)	/* PWM13T2计数值  - Pulse Width Modulation*/
#define PWM14T1 (*(volatile __xdata unsigned int *)0xff80)	/* PWM14T1计数值  - Pulse Width Modulation*/
#define PWM14T2 (*(volatile __xdata unsigned int *)0xff82)	/* PWM14T2计数值  - Pulse Width Modulation*/
#define PWM15T1 (*(volatile __xdata unsigned int *)0xff88)	/* PWM15T1计数值  - Pulse Width Modulation*/
#define PWM15T2 (*(volatile __xdata unsigned int *)0xff8a)	/* PWM15T2计数值  - Pulse Width Modulation*/
#define PWM16T1 (*(volatile __xdata unsigned int *)0xff90)	/* PWM16T1计数值  - Pulse Width Modulation*/
#define PWM16T2 (*(volatile __xdata unsigned int *)0xff92)	/* PWM16T2计数值  - Pulse Width Modulation*/
#define PWM17T1 (*(volatile __xdata unsigned int *)0xff98)	/* PWM17T1计数值  - Pulse Width Modulation*/
#define PWM17T2 (*(volatile __xdata unsigned int *)0xff9a)	/* PWM17T2计数值  - Pulse Width Modulation*/
#define PWM2C (*(volatile __xdata unsigned int *)0xffa0)	/* PWM2计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM2TADC (*(volatile __xdata unsigned int *)0xffa3)	/* PWM2触发ADC计数  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM20T1 (*(volatile __xdata unsigned int *)0xffb0)	/* PWM20T1计数值  - Pulse Width Modulation*/
#define PWM20T2 (*(volatile __xdata unsigned int *)0xffb2)	/* PWM20T2计数值  - Pulse Width Modulation*/
#define PWM21T1 (*(volatile __xdata unsigned int *)0xffb8)	/* PWM21T1计数值  - Pulse Width Modulation*/
#define PWM21T2 (*(volatile __xdata unsigned int *)0xffba)	/* PWM21T2计数值  - Pulse Width Modulation*/
#define PWM22T1 (*(volatile __xdata unsigned int *)0xffc0)	/* PWM22T1计数值  - Pulse Width Modulation*/
#define PWM22T2 (*(volatile __xdata unsigned int *)0xffc2)	/* PWM22T2计数值  - Pulse Width Modulation*/
#define PWM23T1 (*(volatile __xdata unsigned int *)0xffc8)	/* PWM23T1计数值  - Pulse Width Modulation*/
#define PWM23T2 (*(volatile __xdata unsigned int *)0xffca)	/* PWM23T2计数值  - Pulse Width Modulation*/
#define PWM24T1 (*(volatile __xdata unsigned int *)0xffd0)	/* PWM24T1计数值  - Pulse Width Modulation*/
#define PWM24T2 (*(volatile __xdata unsigned int *)0xffd2)	/* PWM24T2计数值  - Pulse Width Modulation*/
#define PWM25T1 (*(volatile __xdata unsigned int *)0xffd8)	/* PWM25T1计数值  - Pulse Width Modulation*/
#define PWM25T2 (*(volatile __xdata unsigned int *)0xffda)	/* PWM25T2计数值  - Pulse Width Modulation*/
#define PWM26T1 (*(volatile __xdata unsigned int *)0xffe0)	/* PWM26T1计数值  - Pulse Width Modulation*/
#define PWM26T2 (*(volatile __xdata unsigned int *)0xffe2)	/* PWM26T2计数值  - Pulse Width Modulation*/
#define PWM27T1 (*(volatile __xdata unsigned int *)0xffe8)	/* PWM27T1计数值  - Pulse Width Modulation*/
#define PWM27T2 (*(volatile __xdata unsigned int *)0xffea)	/* PWM27T2计数值  - Pulse Width Modulation*/
#define PWM3C (*(volatile __xdata unsigned int *)0xfc00)	/* PWM3计数器  - Counter - Pulse Width Modulation*/
#define PWM3TADC (*(volatile __xdata unsigned int *)0xfc03)	/* PWM3触发ADC计数  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM30T1 (*(volatile __xdata unsigned int *)0xfc10)	/* PWM30T1计数值  - Pulse Width Modulation*/
#define PWM30T2 (*(volatile __xdata unsigned int *)0xfc12)	/* PWM30T2计数值  - Pulse Width Modulation*/
#define PWM31T1 (*(volatile __xdata unsigned int *)0xfc18)	/* PWM31T1计数值  - Pulse Width Modulation*/
#define PWM31T2 (*(volatile __xdata unsigned int *)0xfc1a)	/* PWM31T2计数值  - Pulse Width Modulation*/
#define PWM32T1 (*(volatile __xdata unsigned int *)0xfc20)	/* PWM32T1计数值  - Pulse Width Modulation*/
#define PWM32T2 (*(volatile __xdata unsigned int *)0xfc22)	/* PWM32T2计数值  - Pulse Width Modulation*/
#define PWM33T1 (*(volatile __xdata unsigned int *)0xfc28)	/* PWM33T1计数值  - Pulse Width Modulation*/
#define PWM33T2 (*(volatile __xdata unsigned int *)0xfc2a)	/* PWM33T2计数值  - Pulse Width Modulation*/
#define PWM34T1 (*(volatile __xdata unsigned int *)0xfc30)	/* PWM34T1计数值  - Pulse Width Modulation*/
#define PWM34T2 (*(volatile __xdata unsigned int *)0xfc32)	/* PWM34T2计数值  - Pulse Width Modulation*/
#define PWM35T1 (*(volatile __xdata unsigned int *)0xfc38)	/* PWM35T1计数值  - Pulse Width Modulation*/
#define PWM35T2 (*(volatile __xdata unsigned int *)0xfc3a)	/* PWM35T2计数值  - Pulse Width Modulation*/
#define PWM36T1 (*(volatile __xdata unsigned int *)0xfc40)	/* PWM36T1计数值  - Pulse Width Modulation*/
#define PWM36T2 (*(volatile __xdata unsigned int *)0xfc42)	/* PWM36T2计数值  - Pulse Width Modulation*/
#define PWM37T1 (*(volatile __xdata unsigned int *)0xfc48)	/* PWM37T1计数值  - Pulse Width Modulation*/
#define PWM37T2 (*(volatile __xdata unsigned int *)0xfc4a)	/* PWM37T2计数值  - Pulse Width Modulation*/
#define PWM4C (*(volatile __xdata unsigned int *)0xfc50)	/* PWM4计数器  - Counter - Pulse Width Modulation*/
#define PWM4TADC (*(volatile __xdata unsigned int *)0xfc53)	/* PWM4触发ADC计数  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM40T1 (*(volatile __xdata unsigned int *)0xfc60)	/* PWM40T1计数值  - Pulse Width Modulation*/
#define PWM40T2 (*(volatile __xdata unsigned int *)0xfc62)	/* PWM40T2计数值  - Pulse Width Modulation*/
#define PWM41T1 (*(volatile __xdata unsigned int *)0xfc68)	/* PWM41T1计数值  - Pulse Width Modulation*/
#define PWM41T2 (*(volatile __xdata unsigned int *)0xfc6a)	/* PWM41T2计数值  - Pulse Width Modulation*/
#define PWM42T1 (*(volatile __xdata unsigned int *)0xfc70)	/* PWM42T1计数值  - Pulse Width Modulation*/
#define PWM42T2 (*(volatile __xdata unsigned int *)0xfc72)	/* PWM42T2计数值  - Pulse Width Modulation*/
#define PWM43T1 (*(volatile __xdata unsigned int *)0xfc78)	/* PWM43T1计数值  - Pulse Width Modulation*/
#define PWM43T2 (*(volatile __xdata unsigned int *)0xfc7a)	/* PWM43T2计数值  - Pulse Width Modulation*/
#define PWM44T1 (*(volatile __xdata unsigned int *)0xfc80)	/* PWM44T1计数值  - Pulse Width Modulation*/
#define PWM44T2 (*(volatile __xdata unsigned int *)0xfc82)	/* PWM44T2计数值  - Pulse Width Modulation*/
#define PWM45T1 (*(volatile __xdata unsigned int *)0xfc88)	/* PWM45T1计数值  - Pulse Width Modulation*/
#define PWM45T2 (*(volatile __xdata unsigned int *)0xfc8a)	/* PWM45T2计数值  - Pulse Width Modulation*/
#define PWM46T1 (*(volatile __xdata unsigned int *)0xfc90)	/* PWM46T1计数值  - Pulse Width Modulation*/
#define PWM46T2 (*(volatile __xdata unsigned int *)0xfc92)	/* PWM46T2计数值  - Pulse Width Modulation*/
#define PWM47T1 (*(volatile __xdata unsigned int *)0xfc98)	/* PWM47T1计数值  - Pulse Width Modulation*/
#define PWM47T2 (*(volatile __xdata unsigned int *)0xfc9a)	/* PWM47T2计数值  - Pulse Width Modulation*/
#define PWM5C (*(volatile __xdata unsigned int *)0xfca0)	/* PWM4计数器  - Counter - Pulse Width Modulation*/
#define PWM5TADC (*(volatile __xdata unsigned int *)0xfca3)	/* PWM4触发ADC计数  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM50T1 (*(volatile __xdata unsigned int *)0xfcb0)	/* PWM40T1计数值  - Pulse Width Modulation*/
#define PWM50T2 (*(volatile __xdata unsigned int *)0xfcb2)	/* PWM40T2计数值  - Pulse Width Modulation*/
#define PWM51T1 (*(volatile __xdata unsigned int *)0xfcb8)	/* PWM41T1计数值  - Pulse Width Modulation*/
#define PWM51T2 (*(volatile __xdata unsigned int *)0xfcba)	/* PWM41T2计数值  - Pulse Width Modulation*/
#define PWM52T1 (*(volatile __xdata unsigned int *)0xfcc0)	/* PWM42T1计数值  - Pulse Width Modulation*/
#define PWM52T2 (*(volatile __xdata unsigned int *)0xfcc2)	/* PWM42T2计数值  - Pulse Width Modulation*/
#define PWM53T1 (*(volatile __xdata unsigned int *)0xfcc8)	/* PWM43T1计数值  - Pulse Width Modulation*/
#define PWM53T2 (*(volatile __xdata unsigned int *)0xfcca)	/* PWM43T2计数值  - Pulse Width Modulation*/
#define PWM54T1 (*(volatile __xdata unsigned int *)0xfcd0)	/* PWM44T1计数值  - Pulse Width Modulation*/
#define PWM54T2 (*(volatile __xdata unsigned int *)0xfcd2)	/* PWM44T2计数值  - Pulse Width Modulation*/
#define PWM55T1 (*(volatile __xdata unsigned int *)0xfcd8)	/* PWM45T1计数值  - Pulse Width Modulation*/
#define PWM55T2 (*(volatile __xdata unsigned int *)0xfcda)	/* PWM45T2计数值  - Pulse Width Modulation*/
#define PWM56T1 (*(volatile __xdata unsigned int *)0xfce0)	/* PWM46T1计数值  - Pulse Width Modulation*/
#define PWM56T2 (*(volatile __xdata unsigned int *)0xfce2)	/* PWM46T2计数值  - Pulse Width Modulation*/
#define PWM57T1 (*(volatile __xdata unsigned int *)0xfce8)	/* PWM47T1计数值  - Pulse Width Modulation*/
#define PWM57T2 (*(volatile __xdata unsigned int *)0xfcea)	/* PWM47T2计数值  - Pulse Width Modulation*/

#define PWM0CH (*(volatile __xdata unsigned char *)0xff00)	/* PWM0计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM0CL (*(volatile __xdata unsigned char *)0xff01)	/* PWM0计数器低字节  - Counter - Pulse Width Modulation*/
#define PWM0CKS (*(volatile __xdata unsigned char *)0xff02)	/* PWM0时钟选择  - Clock - Pulse Width Modulation*/
#define PWM0TADCH (*(volatile __xdata unsigned char *)0xff03)	/* PWM0触发ADC计数高字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM0TADCL (*(volatile __xdata unsigned char *)0xff04)	/* PWM0触发ADC计数低字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM0IF (*(volatile __xdata unsigned char *)0xff05)	/* PWM0中断标志寄存器     - Interrupt - Flag - Pulse Width Modulation*/
#define PWM0FDCR (*(volatile __xdata unsigned char *)0xff06)	/* PWM0异常检测控制寄存器  - Control - Pulse Width Modulation*/

#define PWM00T1H (*(volatile __xdata unsigned char *)0xff10)	/* PWM00T1计数值高字节  - Pulse Width Modulation*/
#define PWM00T1L (*(volatile __xdata unsigned char *)0xff11)	/* PWM00T1计数值低字节  - Pulse Width Modulation*/
#define PWM00T2H (*(volatile __xdata unsigned char *)0xff12)	/* PWM00T2计数值高字节  - Pulse Width Modulation*/
#define PWM00T2L (*(volatile __xdata unsigned char *)0xff13)	/* PWM00T2计数值低字节  - Pulse Width Modulation*/
#define PWM00CR (*(volatile __xdata unsigned char *)0xff14)	/* PWM00控制寄存器      - Control - Pulse Width Modulation*/
#define PWM00HLD (*(volatile __xdata unsigned char *)0xff15)	/* PWM00电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM01T1H (*(volatile __xdata unsigned char *)0xff18)	/* PWM01T1计数值高字节  - Pulse Width Modulation*/
#define PWM01T1L (*(volatile __xdata unsigned char *)0xff19)	/* PWM01T1计数值低字节  - Pulse Width Modulation*/
#define PWM01T2H (*(volatile __xdata unsigned char *)0xff1a)	/* PWM01T2计数值高字节  - Pulse Width Modulation*/
#define PWM01T2L (*(volatile __xdata unsigned char *)0xff1b)	/* PWM01T2计数值低字节  - Pulse Width Modulation*/
#define PWM01CR (*(volatile __xdata unsigned char *)0xff1c)	/* PWM01控制寄存器      - Control - Pulse Width Modulation*/
#define PWM01HLD (*(volatile __xdata unsigned char *)0xff1d)	/* PWM01电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM02T1H (*(volatile __xdata unsigned char *)0xff20)	/* PWM02T1计数值高字节  - Pulse Width Modulation*/
#define PWM02T1L (*(volatile __xdata unsigned char *)0xff21)	/* PWM02T1计数值低字节  - Pulse Width Modulation*/
#define PWM02T2H (*(volatile __xdata unsigned char *)0xff22)	/* PWM02T2计数值高字节  - Pulse Width Modulation*/
#define PWM02T2L (*(volatile __xdata unsigned char *)0xff23)	/* PWM02T2计数值低字节  - Pulse Width Modulation*/
#define PWM02CR (*(volatile __xdata unsigned char *)0xff24)	/* PWM02控制寄存器      - Control - Pulse Width Modulation*/
#define PWM02HLD (*(volatile __xdata unsigned char *)0xff25)	/* PWM02电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM03T1H (*(volatile __xdata unsigned char *)0xff28)	/* PWM03T1计数值高字节  - Pulse Width Modulation*/
#define PWM03T1L (*(volatile __xdata unsigned char *)0xff29)	/* PWM03T1计数值低字节  - Pulse Width Modulation*/
#define PWM03T2H (*(volatile __xdata unsigned char *)0xff2a)	/* PWM03T2计数值高字节  - Pulse Width Modulation*/
#define PWM03T2L (*(volatile __xdata unsigned char *)0xff2b)	/* PWM03T2计数值低字节  - Pulse Width Modulation*/
#define PWM03CR (*(volatile __xdata unsigned char *)0xff2c)	/* PWM03控制寄存器      - Control - Pulse Width Modulation*/
#define PWM03HLD (*(volatile __xdata unsigned char *)0xff2d)	/* PWM03电平保持控制寄存器  - Control - Pulse Width Modulation*/

