aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
#define PWM04T1H (*(volatile __xdata unsigned char *)0xff30)	/* PWM04T1计数值高字节  - Pulse Width Modulation*/
#define PWM04T1L (*(volatile __xdata unsigned char *)0xff31)	/* PWM04T1计数值低字节  - Pulse Width Modulation*/
#define PWM04T2H (*(volatile __xdata unsigned char *)0xff32)	/* PWM04T2计数值高字节  - Pulse Width Modulation*/
#define PWM04T2L (*(volatile __xdata unsigned char *)0xff33)	/* PWM04T2计数值低字节  - Pulse Width Modulation*/
#define PWM04CR (*(volatile __xdata unsigned char *)0xff34)	/* PWM04控制寄存器      - Control - Pulse Width Modulation*/
#define PWM04HLD (*(volatile __xdata unsigned char *)0xff35)	/* PWM04电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM05T1H (*(volatile __xdata unsigned char *)0xff38)	/* PWM05T1计数值高字节  - Pulse Width Modulation*/
#define PWM05T1L (*(volatile __xdata unsigned char *)0xff39)	/* PWM05T1计数值低字节  - Pulse Width Modulation*/
#define PWM05T2H (*(volatile __xdata unsigned char *)0xff3a)	/* PWM05T2计数值高字节  - Pulse Width Modulation*/
#define PWM05T2L (*(volatile __xdata unsigned char *)0xff3b)	/* PWM05T2计数值低字节  - Pulse Width Modulation*/
#define PWM05CR (*(volatile __xdata unsigned char *)0xff3c)	/* PWM05控制寄存器      - Control - Pulse Width Modulation*/
#define PWM05HLD (*(volatile __xdata unsigned char *)0xff3d)	/* PWM05电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM06T1H (*(volatile __xdata unsigned char *)0xff40)	/* PWM06T1计数值高字节  - Pulse Width Modulation*/
#define PWM06T1L (*(volatile __xdata unsigned char *)0xff41)	/* PWM06T1计数值低字节  - Pulse Width Modulation*/
#define PWM06T2H (*(volatile __xdata unsigned char *)0xff42)	/* PWM06T2计数值高字节  - Pulse Width Modulation*/
#define PWM06T2L (*(volatile __xdata unsigned char *)0xff43)	/* PWM06T2计数值低字节  - Pulse Width Modulation*/
#define PWM06CR (*(volatile __xdata unsigned char *)0xff44)	/* PWM06控制寄存器      - Control - Pulse Width Modulation*/
#define PWM06HLD (*(volatile __xdata unsigned char *)0xff45)	/* PWM06电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM07T1H (*(volatile __xdata unsigned char *)0xff48)	/* PWM07T1计数值高字节  - Pulse Width Modulation*/
#define PWM07T1L (*(volatile __xdata unsigned char *)0xff49)	/* PWM07T1计数值低字节  - Pulse Width Modulation*/
#define PWM07T2H (*(volatile __xdata unsigned char *)0xff4a)	/* PWM07T2计数值高字节  - Pulse Width Modulation*/
#define PWM07T2L (*(volatile __xdata unsigned char *)0xff4b)	/* PWM07T2计数值低字节  - Pulse Width Modulation*/
#define PWM07CR (*(volatile __xdata unsigned char *)0xff4c)	/* PWM07控制寄存器      - Control - Pulse Width Modulation*/
#define PWM07HLD (*(volatile __xdata unsigned char *)0xff4d)	/* PWM07电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM1CH (*(volatile __xdata unsigned char *)0xff50)	/* PWM1计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM1CL (*(volatile __xdata unsigned char *)0xff51)	/* PWM1计数器低字节  - Counter - Pulse Width Modulation*/
#define PWM1CKS (*(volatile __xdata unsigned char *)0xff52)	/* PWM1时钟选择  - Clock - Pulse Width Modulation*/
#define PWM1TADCH (*(volatile __xdata unsigned char *)0xff53)	/* PWM1触发ADC计数高字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM1TADCL (*(volatile __xdata unsigned char *)0xff54)	/* PWM1触发ADC计数低字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM1IF (*(volatile __xdata unsigned char *)0xff55)	/* PWM1中断标志寄存器     - Interrupt - Flag - Pulse Width Modulation*/
#define PWM1FDCR (*(volatile __xdata unsigned char *)0xff56)	/* PWM1异常检测控制寄存器  - Control - Pulse Width Modulation*/

#define PWM10T1H (*(volatile __xdata unsigned char *)0xff60)	/* PWM10T1计数值高字节  - Pulse Width Modulation*/
#define PWM10T1L (*(volatile __xdata unsigned char *)0xff61)	/* PWM10T1计数值低字节  - Pulse Width Modulation*/
#define PWM10T2H (*(volatile __xdata unsigned char *)0xff62)	/* PWM10T2计数值高字节  - Pulse Width Modulation*/
#define PWM10T2L (*(volatile __xdata unsigned char *)0xff63)	/* PWM10T2计数值低字节  - Pulse Width Modulation*/
#define PWM10CR (*(volatile __xdata unsigned char *)0xff64)	/* PWM10控制寄存器      - Control - Pulse Width Modulation*/
#define PWM10HLD (*(volatile __xdata unsigned char *)0xff65)	/* PWM10电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM11T1H (*(volatile __xdata unsigned char *)0xff68)	/* PWM11T1计数值高字节  - Pulse Width Modulation*/
#define PWM11T1L (*(volatile __xdata unsigned char *)0xff69)	/* PWM11T1计数值低字节  - Pulse Width Modulation*/
#define PWM11T2H (*(volatile __xdata unsigned char *)0xff6a)	/* PWM11T2计数值高字节  - Pulse Width Modulation*/
#define PWM11T2L (*(volatile __xdata unsigned char *)0xff6b)	/* PWM11T2计数值低字节  - Pulse Width Modulation*/
#define PWM11CR (*(volatile __xdata unsigned char *)0xff6c)	/* PWM11控制寄存器      - Control - Pulse Width Modulation*/
#define PWM11HLD (*(volatile __xdata unsigned char *)0xff6d)	/* PWM11电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM12T1H (*(volatile __xdata unsigned char *)0xff70)	/* PWM12T1计数值高字节  - Pulse Width Modulation*/
#define PWM12T1L (*(volatile __xdata unsigned char *)0xff71)	/* PWM12T1计数值低字节  - Pulse Width Modulation*/
#define PWM12T2H (*(volatile __xdata unsigned char *)0xff72)	/* PWM12T2计数值高字节  - Pulse Width Modulation*/
#define PWM12T2L (*(volatile __xdata unsigned char *)0xff73)	/* PWM12T2计数值低字节  - Pulse Width Modulation*/
#define PWM12CR (*(volatile __xdata unsigned char *)0xff74)	/* PWM12控制寄存器      - Control - Pulse Width Modulation*/
#define PWM12HLD (*(volatile __xdata unsigned char *)0xff75)	/* PWM12电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM13T1H (*(volatile __xdata unsigned char *)0xff78)	/* PWM13T1计数值高字节  - Pulse Width Modulation*/
#define PWM13T1L (*(volatile __xdata unsigned char *)0xff79)	/* PWM13T1计数值低字节  - Pulse Width Modulation*/
#define PWM13T2H (*(volatile __xdata unsigned char *)0xff7a)	/* PWM13T2计数值高字节  - Pulse Width Modulation*/
#define PWM13T2L (*(volatile __xdata unsigned char *)0xff7b)	/* PWM13T2计数值低字节  - Pulse Width Modulation*/
#define PWM13CR (*(volatile __xdata unsigned char *)0xff7c)	/* PWM13控制寄存器      - Control - Pulse Width Modulation*/
#define PWM13HLD (*(volatile __xdata unsigned char *)0xff7d)	/* PWM13电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM14T1H (*(volatile __xdata unsigned char *)0xff80)	/* PWM14T1计数值高字节  - Pulse Width Modulation*/
#define PWM14T1L (*(volatile __xdata unsigned char *)0xff81)	/* PWM14T1计数值低字节  - Pulse Width Modulation*/
#define PWM14T2H (*(volatile __xdata unsigned char *)0xff82)	/* PWM14T2计数值高字节  - Pulse Width Modulation*/
#define PWM14T2L (*(volatile __xdata unsigned char *)0xff83)	/* PWM14T2计数值低字节  - Pulse Width Modulation*/
#define PWM14CR (*(volatile __xdata unsigned char *)0xff84)	/* PWM14控制寄存器      - Control - Pulse Width Modulation*/
#define PWM14HLD (*(volatile __xdata unsigned char *)0xff85)	/* PWM14电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM15T1H (*(volatile __xdata unsigned char *)0xff88)	/* PWM15T1计数值高字节  - Pulse Width Modulation*/
#define PWM15T1L (*(volatile __xdata unsigned char *)0xff89)	/* PWM15T1计数值低字节  - Pulse Width Modulation*/
#define PWM15T2H (*(volatile __xdata unsigned char *)0xff8a)	/* PWM15T2计数值高字节  - Pulse Width Modulation*/
#define PWM15T2L (*(volatile __xdata unsigned char *)0xff8b)	/* PWM15T2计数值低字节  - Pulse Width Modulation*/
#define PWM15CR (*(volatile __xdata unsigned char *)0xff8c)	/* PWM15控制寄存器      - Control - Pulse Width Modulation*/
#define PWM15HLD (*(volatile __xdata unsigned char *)0xff8d)	/* PWM15电平保持控制寄存器  - Control - Pulse Width Modulation*/

