aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
#define PWM16T1H (*(volatile __xdata unsigned char *)0xff90)	/* PWM16T1计数值高字节  - Pulse Width Modulation*/
#define PWM16T1L (*(volatile __xdata unsigned char *)0xff91)	/* PWM16T1计数值低字节  - Pulse Width Modulation*/
#define PWM16T2H (*(volatile __xdata unsigned char *)0xff92)	/* PWM16T2计数值高字节  - Pulse Width Modulation*/
#define PWM16T2L (*(volatile __xdata unsigned char *)0xff93)	/* PWM16T2计数值低字节  - Pulse Width Modulation*/
#define PWM16CR (*(volatile __xdata unsigned char *)0xff94)	/* PWM16控制寄存器      - Control - Pulse Width Modulation*/
#define PWM16HLD (*(volatile __xdata unsigned char *)0xff95)	/* PWM16电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM17T1H (*(volatile __xdata unsigned char *)0xff98)	/* PWM17T1计数值高字节  - Pulse Width Modulation*/
#define PWM17T1L (*(volatile __xdata unsigned char *)0xff99)	/* PWM17T1计数值低字节  - Pulse Width Modulation*/
#define PWM17T2H (*(volatile __xdata unsigned char *)0xff9a)	/* PWM17T2计数值高字节  - Pulse Width Modulation*/
#define PWM17T2L (*(volatile __xdata unsigned char *)0xff9b)	/* PWM17T2计数值低字节  - Pulse Width Modulation*/
#define PWM17CR (*(volatile __xdata unsigned char *)0xff9c)	/* PWM17控制寄存器      - Control - Pulse Width Modulation*/
#define PWM17HLD (*(volatile __xdata unsigned char *)0xff9d)	/* PWM17电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM2CH (*(volatile __xdata unsigned char *)0xffa0)	/* PWM2计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM2CL (*(volatile __xdata unsigned char *)0xffa1)	/* PWM2计数器低字节  - Counter - Pulse Width Modulation*/
#define PWM2CKS (*(volatile __xdata unsigned char *)0xffa2)	/* PWM2时钟选择  - Clock - Pulse Width Modulation*/
#define PWM2TADCH (*(volatile __xdata unsigned char *)0xffa3)	/* PWM2触发ADC计数高字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM2TADCL (*(volatile __xdata unsigned char *)0xffa4)	/* PWM2触发ADC计数低字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM2IF (*(volatile __xdata unsigned char *)0xffa5)	/* PWM2中断标志寄存器     - Interrupt - Flag - Pulse Width Modulation*/
#define PWM2FDCR (*(volatile __xdata unsigned char *)0xffa6)	/* PWM2异常检测控制寄存器  - Control - Pulse Width Modulation*/

#define PWM20T1H (*(volatile __xdata unsigned char *)0xffb0)	/* PWM20T1计数值高字节  - Pulse Width Modulation*/
#define PWM20T1L (*(volatile __xdata unsigned char *)0xffb1)	/* PWM20T1计数值低字节  - Pulse Width Modulation*/
#define PWM20T2H (*(volatile __xdata unsigned char *)0xffb2)	/* PWM20T2计数值高字节  - Pulse Width Modulation*/
#define PWM20T2L (*(volatile __xdata unsigned char *)0xffb3)	/* PWM20T2计数值低字节  - Pulse Width Modulation*/
#define PWM20CR (*(volatile __xdata unsigned char *)0xffb4)	/* PWM20控制寄存器      - Control - Pulse Width Modulation*/
#define PWM20HLD (*(volatile __xdata unsigned char *)0xffb5)	/* PWM20电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM21T1H (*(volatile __xdata unsigned char *)0xffb8)	/* PWM21T1计数值高字节  - Pulse Width Modulation*/
#define PWM21T1L (*(volatile __xdata unsigned char *)0xffb9)	/* PWM21T1计数值低字节  - Pulse Width Modulation*/
#define PWM21T2H (*(volatile __xdata unsigned char *)0xffba)	/* PWM21T2计数值高字节  - Pulse Width Modulation*/
#define PWM21T2L (*(volatile __xdata unsigned char *)0xffbb)	/* PWM21T2计数值低字节  - Pulse Width Modulation*/
#define PWM21CR (*(volatile __xdata unsigned char *)0xffbc)	/* PWM21控制寄存器      - Control - Pulse Width Modulation*/
#define PWM21HLD (*(volatile __xdata unsigned char *)0xffbd)	/* PWM21电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM22T1H (*(volatile __xdata unsigned char *)0xffc0)	/* PWM22T1计数值高字节  - Pulse Width Modulation*/
#define PWM22T1L (*(volatile __xdata unsigned char *)0xffc1)	/* PWM22T1计数值低字节  - Pulse Width Modulation*/
#define PWM22T2H (*(volatile __xdata unsigned char *)0xffc2)	/* PWM22T2计数值高字节  - Pulse Width Modulation*/
#define PWM22T2L (*(volatile __xdata unsigned char *)0xffc3)	/* PWM22T2计数值低字节  - Pulse Width Modulation*/
#define PWM22CR (*(volatile __xdata unsigned char *)0xffc4)	/* PWM22控制寄存器      - Control - Pulse Width Modulation*/
#define PWM22HLD (*(volatile __xdata unsigned char *)0xffc5)	/* PWM22电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM23T1H (*(volatile __xdata unsigned char *)0xffc8)	/* PWM23T1计数值高字节  - Pulse Width Modulation*/
#define PWM23T1L (*(volatile __xdata unsigned char *)0xffc9)	/* PWM23T1计数值低字节  - Pulse Width Modulation*/
#define PWM23T2H (*(volatile __xdata unsigned char *)0xffca)	/* PWM23T2计数值高字节  - Pulse Width Modulation*/
#define PWM23T2L (*(volatile __xdata unsigned char *)0xffcb)	/* PWM23T2计数值低字节  - Pulse Width Modulation*/
#define PWM23CR (*(volatile __xdata unsigned char *)0xffcc)	/* PWM23控制寄存器      - Control - Pulse Width Modulation*/
#define PWM23HLD (*(volatile __xdata unsigned char *)0xffcd)	/* PWM23电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM24T1H (*(volatile __xdata unsigned char *)0xffd0)	/* PWM24T1计数值高字节  - Pulse Width Modulation*/
#define PWM24T1L (*(volatile __xdata unsigned char *)0xffd1)	/* PWM24T1计数值低字节  - Pulse Width Modulation*/
#define PWM24T2H (*(volatile __xdata unsigned char *)0xffd2)	/* PWM24T2计数值高字节  - Pulse Width Modulation*/
#define PWM24T2L (*(volatile __xdata unsigned char *)0xffd3)	/* PWM24T2计数值低字节  - Pulse Width Modulation*/
#define PWM24CR (*(volatile __xdata unsigned char *)0xffd4)	/* PWM24控制寄存器      - Control - Pulse Width Modulation*/
#define PWM24HLD (*(volatile __xdata unsigned char *)0xffd5)	/* PWM24电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM25T1H (*(volatile __xdata unsigned char *)0xffd8)	/* PWM25T1计数值高字节  - Pulse Width Modulation*/
#define PWM25T1L (*(volatile __xdata unsigned char *)0xffd9)	/* PWM25T1计数值低字节  - Pulse Width Modulation*/
#define PWM25T2H (*(volatile __xdata unsigned char *)0xffda)	/* PWM25T2计数值高字节  - Pulse Width Modulation*/
#define PWM25T2L (*(volatile __xdata unsigned char *)0xffdb)	/* PWM25T2计数值低字节  - Pulse Width Modulation*/
#define PWM25CR (*(volatile __xdata unsigned char *)0xffdc)	/* PWM25控制寄存器      - Control - Pulse Width Modulation*/
#define PWM25HLD (*(volatile __xdata unsigned char *)0xffdd)	/* PWM25电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM26T1H (*(volatile __xdata unsigned char *)0xffe0)	/* PWM26T1计数值高字节  - Pulse Width Modulation*/
#define PWM26T1L (*(volatile __xdata unsigned char *)0xffe1)	/* PWM26T1计数值低字节  - Pulse Width Modulation*/
#define PWM26T2H (*(volatile __xdata unsigned char *)0xffe2)	/* PWM26T2计数值高字节  - Pulse Width Modulation*/
#define PWM26T2L (*(volatile __xdata unsigned char *)0xffe3)	/* PWM26T2计数值低字节  - Pulse Width Modulation*/
#define PWM26CR (*(volatile __xdata unsigned char *)0xffe4)	/* PWM26控制寄存器      - Control - Pulse Width Modulation*/
#define PWM26HLD (*(volatile __xdata unsigned char *)0xffe5)	/* PWM26电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM27T1H (*(volatile __xdata unsigned char *)0xffe8)	/* PWM27T1计数值高字节  - Pulse Width Modulation*/
#define PWM27T1L (*(volatile __xdata unsigned char *)0xffe9)	/* PWM27T1计数值低字节  - Pulse Width Modulation*/
#define PWM27T2H (*(volatile __xdata unsigned char *)0xffea)	/* PWM27T2计数值高字节  - Pulse Width Modulation*/
#define PWM27T2L (*(volatile __xdata unsigned char *)0xffeb)	/* PWM27T2计数值低字节  - Pulse Width Modulation*/
#define PWM27CR (*(volatile __xdata unsigned char *)0xffec)	/* PWM27控制寄存器      - Control - Pulse Width Modulation*/
#define PWM27HLD (*(volatile __xdata unsigned char *)0xffed)	/* PWM27电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM3CH (*(volatile __xdata unsigned char *)0xfc00)	/* PWM3计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM3CL (*(volatile __xdata unsigned char *)0xfc01)	/* PWM3计数器低字节  - Counter - Pulse Width Modulation*/
#define PWM3CKS (*(volatile __xdata unsigned char *)0xfc02)	/* PWM3时钟选择  - Clock - Pulse Width Modulation*/
#define PWM3TADCH (*(volatile __xdata unsigned char *)0xfc03)	/* PWM3触发ADC计数高字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM3TADCL (*(volatile __xdata unsigned char *)0xfc04)	/* PWM3触发ADC计数低字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM3IF (*(volatile __xdata unsigned char *)0xfc05)	/* PWM3中断标志寄存器     - Interrupt - Flag - Pulse Width Modulation*/
#define PWM3FDCR (*(volatile __xdata unsigned char *)0xfc06)	/* PWM3异常检测控制寄存器  - Control - Pulse Width Modulation*/

#define PWM30T1H (*(volatile __xdata unsigned char *)0xfc10)	/* PWM30T1计数值高字节  - Pulse Width Modulation*/
#define PWM30T1L (*(volatile __xdata unsigned char *)0xfc11)	/* PWM30T1计数值低字节  - Pulse Width Modulation*/
#define PWM30T2H (*(volatile __xdata unsigned char *)0xfc12)	/* PWM30T2计数值高字节  - Pulse Width Modulation*/
#define PWM30T2L (*(volatile __xdata unsigned char *)0xfc13)	/* PWM30T2计数值低字节  - Pulse Width Modulation*/
#define PWM30CR (*(volatile __xdata unsigned char *)0xfc14)	/* PWM30控制寄存器      - Control - Pulse Width Modulation*/
#define PWM30HLD (*(volatile __xdata unsigned char *)0xfc15)	/* PWM30电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM31T1H (*(volatile __xdata unsigned char *)0xfc18)	/* PWM31T1计数值高字节  - Pulse Width Modulation*/
#define PWM31T1L (*(volatile __xdata unsigned char *)0xfc19)	/* PWM31T1计数值低字节  - Pulse Width Modulation*/
#define PWM31T2H (*(volatile __xdata unsigned char *)0xfc1a)	/* PWM31T2计数值高字节  - Pulse Width Modulation*/
#define PWM31T2L (*(volatile __xdata unsigned char *)0xfc1b)	/* PWM31T2计数值低字节  - Pulse Width Modulation*/
#define PWM31CR (*(volatile __xdata unsigned char *)0xfc1c)	/* PWM31控制寄存器      - Control - Pulse Width Modulation*/
#define PWM31HLD (*(volatile __xdata unsigned char *)0xfc1d)	/* PWM31电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM32T1H (*(volatile __xdata unsigned char *)0xfc20)	/* PWM32T1计数值高字节  - Pulse Width Modulation*/
#define PWM32T1L (*(volatile __xdata unsigned char *)0xfc21)	/* PWM32T1计数值低字节  - Pulse Width Modulation*/
#define PWM32T2H (*(volatile __xdata unsigned char *)0xfc22)	/* PWM32T2计数值高字节  - Pulse Width Modulation*/
#define PWM32T2L (*(volatile __xdata unsigned char *)0xfc23)	/* PWM32T2计数值低字节  - Pulse Width Modulation*/
#define PWM32CR (*(volatile __xdata unsigned char *)0xfc24)	/* PWM32控制寄存器      - Control - Pulse Width Modulation*/
#define PWM32HLD (*(volatile __xdata unsigned char *)0xfc25)	/* PWM32电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM33T1H (*(volatile __xdata unsigned char *)0xfc28)	/* PWM33T1计数值高字节  - Pulse Width Modulation*/
#define PWM33T1L (*(volatile __xdata unsigned char *)0xfc29)	/* PWM33T1计数值低字节  - Pulse Width Modulation*/
#define PWM33T2H (*(volatile __xdata unsigned char *)0xfc2a)	/* PWM33T2计数值高字节  - Pulse Width Modulation*/
#define PWM33T2L (*(volatile __xdata unsigned char *)0xfc2b)	/* PWM33T2计数值低字节  - Pulse Width Modulation*/
#define PWM33CR (*(volatile __xdata unsigned char *)0xfc2c)	/* PWM33控制寄存器      - Control - Pulse Width Modulation*/
#define PWM33HLD (*(volatile __xdata unsigned char *)0xfc2d)	/* PWM33电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM34T1H (*(volatile __xdata unsigned char *)0xfc30)	/* PWM34T1计数值高字节  - Pulse Width Modulation*/
#define PWM34T1L (*(volatile __xdata unsigned char *)0xfc31)	/* PWM34T1计数值低字节  - Pulse Width Modulation*/
#define PWM34T2H (*(volatile __xdata unsigned char *)0xfc32)	/* PWM34T2计数值高字节  - Pulse Width Modulation*/
#define PWM34T2L (*(volatile __xdata unsigned char *)0xfc33)	/* PWM34T2计数值低字节  - Pulse Width Modulation*/
#define PWM34CR (*(volatile __xdata unsigned char *)0xfc34)	/* PWM34控制寄存器      - Control - Pulse Width Modulation*/
#define PWM34HLD (*(volatile __xdata unsigned char *)0xfc35)	/* PWM34电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM35T1H (*(volatile __xdata unsigned char *)0xfc38)	/* PWM35T1计数值高字节  - Pulse Width Modulation*/
#define PWM35T1L (*(volatile __xdata unsigned char *)0xfc39)	/* PWM35T1计数值低字节  - Pulse Width Modulation*/
#define PWM35T2H (*(volatile __xdata unsigned char *)0xfc3a)	/* PWM35T2计数值高字节  - Pulse Width Modulation*/
#define PWM35T2L (*(volatile __xdata unsigned char *)0xfc3b)	/* PWM35T2计数值低字节  - Pulse Width Modulation*/
#define PWM35CR (*(volatile __xdata unsigned char *)0xfc3c)	/* PWM35控制寄存器      - Control - Pulse Width Modulation*/
#define PWM35HLD (*(volatile __xdata unsigned char *)0xfc3d)	/* PWM35电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM36T1H (*(volatile __xdata unsigned char *)0xfc40)	/* PWM36T1计数值高字节  - Pulse Width Modulation*/
#define PWM36T1L (*(volatile __xdata unsigned char *)0xfc41)	/* PWM36T1计数值低字节  - Pulse Width Modulation*/
#define PWM36T2H (*(volatile __xdata unsigned char *)0xfc42)	/* PWM36T2计数值高字节  - Pulse Width Modulation*/
#define PWM36T2L (*(volatile __xdata unsigned char *)0xfc43)	/* PWM36T2计数值低字节  - Pulse Width Modulation*/
#define PWM36CR (*(volatile __xdata unsigned char *)0xfc44)	/* PWM36控制寄存器      - Control - Pulse Width Modulation*/
#define PWM36HLD (*(volatile __xdata unsigned char *)0xfc45)	/* PWM36电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM37T1H (*(volatile __xdata unsigned char *)0xfc48)	/* PWM37T1计数值高字节  - Pulse Width Modulation*/
#define PWM37T1L (*(volatile __xdata unsigned char *)0xfc49)	/* PWM37T1计数值低字节  - Pulse Width Modulation*/
#define PWM37T2H (*(volatile __xdata unsigned char *)0xfc4a)	/* PWM37T2计数值高字节  - Pulse Width Modulation*/
#define PWM37T2L (*(volatile __xdata unsigned char *)0xfc4b)	/* PWM37T2计数值低字节  - Pulse Width Modulation*/
#define PWM37CR (*(volatile __xdata unsigned char *)0xfc4c)	/* PWM37控制寄存器      - Control - Pulse Width Modulation*/
#define PWM37HLD (*(volatile __xdata unsigned char *)0xfc4d)	/* PWM37电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM4CH (*(volatile __xdata unsigned char *)0xfc50)	/* PWM4计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM4CL (*(volatile __xdata unsigned char *)0xfc51)	/* PWM4计数器低字节  - Counter - Pulse Width Modulation*/
#define PWM4CKS (*(volatile __xdata unsigned char *)0xfc52)	/* PWM4时钟选择  - Clock - Pulse Width Modulation*/
#define PWM4TADCH (*(volatile __xdata unsigned char *)0xfc53)	/* PWM4触发ADC计数高字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM4TADCL (*(volatile __xdata unsigned char *)0xfc54)	/* PWM4触发ADC计数低字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM4IF (*(volatile __xdata unsigned char *)0xfc55)	/* PWM4中断标志寄存器     - Interrupt - Flag - Pulse Width Modulation*/
#define PWM4FDCR (*(volatile __xdata unsigned char *)0xfc56)	/* PWM4异常检测控制寄存器  - Control - Pulse Width Modulation*/

