aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
#define PWM40T1H (*(volatile __xdata unsigned char *)0xfc60)	/* PWM40T1计数值高字节  - Pulse Width Modulation*/
#define PWM40T1L (*(volatile __xdata unsigned char *)0xfc61)	/* PWM40T1计数值低字节  - Pulse Width Modulation*/
#define PWM40T2H (*(volatile __xdata unsigned char *)0xfc62)	/* PWM40T2计数值高字节  - Pulse Width Modulation*/
#define PWM40T2L (*(volatile __xdata unsigned char *)0xfc63)	/* PWM40T2计数值低字节  - Pulse Width Modulation*/
#define PWM40CR (*(volatile __xdata unsigned char *)0xfc64)	/* PWM40控制寄存器      - Control - Pulse Width Modulation*/
#define PWM40HLD (*(volatile __xdata unsigned char *)0xfc65)	/* PWM40电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM41T1H (*(volatile __xdata unsigned char *)0xfc68)	/* PWM41T1计数值高字节  - Pulse Width Modulation*/
#define PWM41T1L (*(volatile __xdata unsigned char *)0xfc69)	/* PWM41T1计数值低字节  - Pulse Width Modulation*/
#define PWM41T2H (*(volatile __xdata unsigned char *)0xfc6a)	/* PWM41T2计数值高字节  - Pulse Width Modulation*/
#define PWM41T2L (*(volatile __xdata unsigned char *)0xfc6b)	/* PWM41T2计数值低字节  - Pulse Width Modulation*/
#define PWM41CR (*(volatile __xdata unsigned char *)0xfc6c)	/* PWM41控制寄存器      - Control - Pulse Width Modulation*/
#define PWM41HLD (*(volatile __xdata unsigned char *)0xfc6d)	/* PWM41电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM42T1H (*(volatile __xdata unsigned char *)0xfc70)	/* PWM42T1计数值高字节  - Pulse Width Modulation*/
#define PWM42T1L (*(volatile __xdata unsigned char *)0xfc71)	/* PWM42T1计数值低字节  - Pulse Width Modulation*/
#define PWM42T2H (*(volatile __xdata unsigned char *)0xfc72)	/* PWM42T2计数值高字节  - Pulse Width Modulation*/
#define PWM42T2L (*(volatile __xdata unsigned char *)0xfc73)	/* PWM42T2计数值低字节  - Pulse Width Modulation*/
#define PWM42CR (*(volatile __xdata unsigned char *)0xfc74)	/* PWM42控制寄存器      - Control - Pulse Width Modulation*/
#define PWM42HLD (*(volatile __xdata unsigned char *)0xfc75)	/* PWM42电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM43T1H (*(volatile __xdata unsigned char *)0xfc78)	/* PWM43T1计数值高字节  - Pulse Width Modulation*/
#define PWM43T1L (*(volatile __xdata unsigned char *)0xfc79)	/* PWM43T1计数值低字节  - Pulse Width Modulation*/
#define PWM43T2H (*(volatile __xdata unsigned char *)0xfc7a)	/* PWM43T2计数值高字节  - Pulse Width Modulation*/
#define PWM43T2L (*(volatile __xdata unsigned char *)0xfc7b)	/* PWM43T2计数值低字节  - Pulse Width Modulation*/
#define PWM43CR (*(volatile __xdata unsigned char *)0xfc7c)	/* PWM43控制寄存器      - Control - Pulse Width Modulation*/
#define PWM43HLD (*(volatile __xdata unsigned char *)0xfc7d)	/* PWM43电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM44T1H (*(volatile __xdata unsigned char *)0xfc80)	/* PWM44T1计数值高字节  - Pulse Width Modulation*/
#define PWM44T1L (*(volatile __xdata unsigned char *)0xfc81)	/* PWM44T1计数值低字节  - Pulse Width Modulation*/
#define PWM44T2H (*(volatile __xdata unsigned char *)0xfc82)	/* PWM44T2计数值高字节  - Pulse Width Modulation*/
#define PWM44T2L (*(volatile __xdata unsigned char *)0xfc83)	/* PWM44T2计数值低字节  - Pulse Width Modulation*/
#define PWM44CR (*(volatile __xdata unsigned char *)0xfc84)	/* PWM44控制寄存器      - Control - Pulse Width Modulation*/
#define PWM44HLD (*(volatile __xdata unsigned char *)0xfc85)	/* PWM44电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM45T1H (*(volatile __xdata unsigned char *)0xfc88)	/* PWM45T1计数值高字节  - Pulse Width Modulation*/
#define PWM45T1L (*(volatile __xdata unsigned char *)0xfc89)	/* PWM45T1计数值低字节  - Pulse Width Modulation*/
#define PWM45T2H (*(volatile __xdata unsigned char *)0xfc8a)	/* PWM45T2计数值高字节  - Pulse Width Modulation*/
#define PWM45T2L (*(volatile __xdata unsigned char *)0xfc8b)	/* PWM45T2计数值低字节  - Pulse Width Modulation*/
#define PWM45CR (*(volatile __xdata unsigned char *)0xfc8c)	/* PWM45控制寄存器      - Control - Pulse Width Modulation*/
#define PWM45HLD (*(volatile __xdata unsigned char *)0xfc8d)	/* PWM45电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM46T1H (*(volatile __xdata unsigned char *)0xfc90)	/* PWM46T1计数值高字节  - Pulse Width Modulation*/
#define PWM46T1L (*(volatile __xdata unsigned char *)0xfc91)	/* PWM46T1计数值低字节  - Pulse Width Modulation*/
#define PWM46T2H (*(volatile __xdata unsigned char *)0xfc92)	/* PWM46T2计数值高字节  - Pulse Width Modulation*/
#define PWM46T2L (*(volatile __xdata unsigned char *)0xfc93)	/* PWM46T2计数值低字节  - Pulse Width Modulation*/
#define PWM46CR (*(volatile __xdata unsigned char *)0xfc94)	/* PWM46控制寄存器      - Control - Pulse Width Modulation*/
#define PWM46HLD (*(volatile __xdata unsigned char *)0xfc95)	/* PWM46电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM47T1H (*(volatile __xdata unsigned char *)0xfc98)	/* PWM47T1计数值高字节  - Pulse Width Modulation*/
#define PWM47T1L (*(volatile __xdata unsigned char *)0xfc99)	/* PWM47T1计数值低字节  - Pulse Width Modulation*/
#define PWM47T2H (*(volatile __xdata unsigned char *)0xfc9a)	/* PWM47T2计数值高字节  - Pulse Width Modulation*/
#define PWM47T2L (*(volatile __xdata unsigned char *)0xfc9b)	/* PWM47T2计数值低字节  - Pulse Width Modulation*/
#define PWM47CR (*(volatile __xdata unsigned char *)0xfc9c)	/* PWM47控制寄存器      - Control - Pulse Width Modulation*/
#define PWM47HLD (*(volatile __xdata unsigned char *)0xfc9d)	/* PWM47电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM5CH (*(volatile __xdata unsigned char *)0xfca0)	/* PWM5计数器高字节  - Counter - Pulse Width Modulation*/
#define PWM5CL (*(volatile __xdata unsigned char *)0xfca1)	/* PWM5计数器低字节  - Counter - Pulse Width Modulation*/
#define PWM5CKS (*(volatile __xdata unsigned char *)0xfca2)	/* PWM5时钟选择  - Clock - Pulse Width Modulation*/
#define PWM5TADCH (*(volatile __xdata unsigned char *)0xfca3)	/* PWM5触发ADC计数高字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM5TADCL (*(volatile __xdata unsigned char *)0xfca4)	/* PWM5触发ADC计数低字节  - Pulse Width Modulation - Analog to Digital Converter*/
#define PWM5IF (*(volatile __xdata unsigned char *)0xfca5)	/* PWM5中断标志寄存器     - Interrupt - Flag - Pulse Width Modulation*/
#define PWM5FDCR (*(volatile __xdata unsigned char *)0xfca6)	/* PWM5异常检测控制寄存器  - Control - Pulse Width Modulation*/

#define PWM50T1H (*(volatile __xdata unsigned char *)0xfcb0)	/* PWM50T1计数值高字节  - Pulse Width Modulation*/
#define PWM50T1L (*(volatile __xdata unsigned char *)0xfcb1)	/* PWM50T1计数值低字节  - Pulse Width Modulation*/
#define PWM50T2H (*(volatile __xdata unsigned char *)0xfcb2)	/* PWM50T2计数值高字节  - Pulse Width Modulation*/
#define PWM50T2L (*(volatile __xdata unsigned char *)0xfcb3)	/* PWM50T2计数值低字节  - Pulse Width Modulation*/
#define PWM50CR (*(volatile __xdata unsigned char *)0xfcb4)	/* PWM50控制寄存器      - Control - Pulse Width Modulation*/
#define PWM50HLD (*(volatile __xdata unsigned char *)0xfcb5)	/* PWM50电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM51T1H (*(volatile __xdata unsigned char *)0xfcb8)	/* PWM51T1计数值高字节  - Pulse Width Modulation*/
#define PWM51T1L (*(volatile __xdata unsigned char *)0xfcb9)	/* PWM51T1计数值低字节  - Pulse Width Modulation*/
#define PWM51T2H (*(volatile __xdata unsigned char *)0xfcba)	/* PWM51T2计数值高字节  - Pulse Width Modulation*/
#define PWM51T2L (*(volatile __xdata unsigned char *)0xfcbb)	/* PWM51T2计数值低字节  - Pulse Width Modulation*/
#define PWM51CR (*(volatile __xdata unsigned char *)0xfcbc)	/* PWM51控制寄存器      - Control - Pulse Width Modulation*/
#define PWM51HLD (*(volatile __xdata unsigned char *)0xfcbd)	/* PWM51电平保持控制寄存器  - Control - Pulse Width Modulation*/

