aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
#define PWM52T1H (*(volatile __xdata unsigned char *)0xfcc0)	/* PWM52T1计数值高字节  - Pulse Width Modulation*/
#define PWM52T1L (*(volatile __xdata unsigned char *)0xfcc1)	/* PWM52T1计数值低字节  - Pulse Width Modulation*/
#define PWM52T2H (*(volatile __xdata unsigned char *)0xfcc2)	/* PWM52T2计数值高字节  - Pulse Width Modulation*/
#define PWM52T2L (*(volatile __xdata unsigned char *)0xfcc3)	/* PWM52T2计数值低字节  - Pulse Width Modulation*/
#define PWM52CR (*(volatile __xdata unsigned char *)0xfcc4)	/* PWM52控制寄存器      - Control - Pulse Width Modulation*/
#define PWM52HLD (*(volatile __xdata unsigned char *)0xfcc5)	/* PWM52电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM53T1H (*(volatile __xdata unsigned char *)0xfcc8)	/* PWM53T1计数值高字节  - Pulse Width Modulation*/
#define PWM53T1L (*(volatile __xdata unsigned char *)0xfcc9)	/* PWM53T1计数值低字节  - Pulse Width Modulation*/
#define PWM53T2H (*(volatile __xdata unsigned char *)0xfcca)	/* PWM53T2计数值高字节  - Pulse Width Modulation*/
#define PWM53T2L (*(volatile __xdata unsigned char *)0xfccb)	/* PWM53T2计数值低字节  - Pulse Width Modulation*/
#define PWM53CR (*(volatile __xdata unsigned char *)0xfccc)	/* PWM53控制寄存器      - Control - Pulse Width Modulation*/
#define PWM53HLD (*(volatile __xdata unsigned char *)0xfccd)	/* PWM53电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM54T1H (*(volatile __xdata unsigned char *)0xfcd0)	/* PWM54T1计数值高字节  - Pulse Width Modulation*/
#define PWM54T1L (*(volatile __xdata unsigned char *)0xfcd1)	/* PWM54T1计数值低字节  - Pulse Width Modulation*/
#define PWM54T2H (*(volatile __xdata unsigned char *)0xfcd2)	/* PWM54T2计数值高字节  - Pulse Width Modulation*/
#define PWM54T2L (*(volatile __xdata unsigned char *)0xfcd3)	/* PWM54T2计数值低字节  - Pulse Width Modulation*/
#define PWM54CR (*(volatile __xdata unsigned char *)0xfcd4)	/* PWM54控制寄存器      - Control - Pulse Width Modulation*/
#define PWM54HLD (*(volatile __xdata unsigned char *)0xfcd5)	/* PWM54电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM55T1H (*(volatile __xdata unsigned char *)0xfcd8)	/* PWM55T1计数值高字节  - Pulse Width Modulation*/
#define PWM55T1L (*(volatile __xdata unsigned char *)0xfcd9)	/* PWM55T1计数值低字节  - Pulse Width Modulation*/
#define PWM55T2H (*(volatile __xdata unsigned char *)0xfcda)	/* PWM55T2计数值高字节  - Pulse Width Modulation*/
#define PWM55T2L (*(volatile __xdata unsigned char *)0xfcdb)	/* PWM55T2计数值低字节  - Pulse Width Modulation*/
#define PWM55CR (*(volatile __xdata unsigned char *)0xfcdc)	/* PWM55控制寄存器      - Control - Pulse Width Modulation*/
#define PWM55HLD (*(volatile __xdata unsigned char *)0xfcdd)	/* PWM55电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM56T1H (*(volatile __xdata unsigned char *)0xfce0)	/* PWM56T1计数值高字节  - Pulse Width Modulation*/
#define PWM56T1L (*(volatile __xdata unsigned char *)0xfce1)	/* PWM56T1计数值低字节  - Pulse Width Modulation*/
#define PWM56T2H (*(volatile __xdata unsigned char *)0xfce2)	/* PWM56T2计数值高字节  - Pulse Width Modulation*/
#define PWM56T2L (*(volatile __xdata unsigned char *)0xfce3)	/* PWM56T2计数值低字节  - Pulse Width Modulation*/
#define PWM56CR (*(volatile __xdata unsigned char *)0xfce4)	/* PWM56控制寄存器      - Control - Pulse Width Modulation*/
#define PWM56HLD (*(volatile __xdata unsigned char *)0xfce5)	/* PWM56电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define PWM57T1H (*(volatile __xdata unsigned char *)0xfce8)	/* PWM57T1计数值高字节  - Pulse Width Modulation*/
#define PWM57T1L (*(volatile __xdata unsigned char *)0xfce9)	/* PWM57T1计数值低字节  - Pulse Width Modulation*/
#define PWM57T2H (*(volatile __xdata unsigned char *)0xfcea)	/* PWM57T2计数值高字节  - Pulse Width Modulation*/
#define PWM57T2L (*(volatile __xdata unsigned char *)0xfceb)	/* PWM57T2计数值低字节  - Pulse Width Modulation*/
#define PWM57CR (*(volatile __xdata unsigned char *)0xfcec)	/* PWM57控制寄存器      - Control - Pulse Width Modulation*/
#define PWM57HLD (*(volatile __xdata unsigned char *)0xfced)	/* PWM57电平保持控制寄存器  - Control - Pulse Width Modulation*/

#define MD3U32    (*(unsigned long volatile xdata *)0xfcf0)	/* MDU数据寄存器  - Data*/
#define MD3U16 (*(volatile __xdata unsigned int *)0xfcf0)	/* MDU数据寄存器  - Data*/
#define MD1U16 (*(volatile __xdata unsigned int *)0xfcf2)	/* MDU数据寄存器  - Data*/
#define MD5U16 (*(volatile __xdata unsigned int *)0xfcf4)	/* MDU数据寄存器  - Data*/

#define MD3 (*(volatile __xdata unsigned char *)0xfcf0)	/* MDU数据寄存器  - Data*/
#define MD2 (*(volatile __xdata unsigned char *)0xfcf1)	/* MDU数据寄存器  - Data*/
#define MD1 (*(volatile __xdata unsigned char *)0xfcf2)	/* MDU数据寄存器  - Data*/
#define MD0 (*(volatile __xdata unsigned char *)0xfcf3)	/* MDU数据寄存器  - Data*/
#define MD5 (*(volatile __xdata unsigned char *)0xfcf4)	/* MDU数据寄存器  - Data*/
#define MD4 (*(volatile __xdata unsigned char *)0xfcf5)	/* MDU数据寄存器  - Data*/
#define ARCON (*(volatile __xdata unsigned char *)0xfcf6)	/* MDU模式控制寄存器  - Mode - Control*/
#define OPCON (*(volatile __xdata unsigned char *)0xfcf7)	/* MDU操作控制寄存器  - Control*/

#define COMEN (*(volatile __xdata unsigned char *)0xfb00)	/* COM使能寄存器  - Enable*/
#define SEGENL (*(volatile __xdata unsigned char *)0xfb01)	/* SEG使能寄存器  - Enable*/
#define SEGENH (*(volatile __xdata unsigned char *)0xfb02)	/* SEG使能寄存器  - Enable*/
#define LEDCTRL (*(volatile __xdata unsigned char *)0xfb03)	/* LED控制寄存器  - Control*/
#define LEDCKS (*(volatile __xdata unsigned char *)0xfb04)	/* LED时钟分频寄存器  - Clock*/

#define COM0_DAL (*(volatile __xdata unsigned char *)0xfb10)	/* 共阳模式显示数据  - Mode - Data*/
#define COM1_DAL (*(volatile __xdata unsigned char *)0xfb11)	/* 共阳模式显示数据  - Mode - Data*/
#define COM2_DAL (*(volatile __xdata unsigned char *)0xfb12)	/* 共阳模式显示数据  - Mode - Data*/
#define COM3_DAL (*(volatile __xdata unsigned char *)0xfb13)	/* 共阳模式显示数据  - Mode - Data*/
#define COM4_DAL (*(volatile __xdata unsigned char *)0xfb14)	/* 共阳模式显示数据  - Mode - Data*/
#define COM5_DAL (*(volatile __xdata unsigned char *)0xfb15)	/* 共阳模式显示数据  - Mode - Data*/
#define COM6_DAL (*(volatile __xdata unsigned char *)0xfb16)	/* 共阳模式显示数据  - Mode - Data*/
#define COM7_DAL (*(volatile __xdata unsigned char *)0xfb17)	/* 共阳模式显示数据  - Mode - Data*/
#define COM0_DAH (*(volatile __xdata unsigned char *)0xfb18)	/* 共阳模式显示数据  - Mode - Data*/
#define COM1_DAH (*(volatile __xdata unsigned char *)0xfb19)	/* 共阳模式显示数据  - Mode - Data*/
#define COM2_DAH (*(volatile __xdata unsigned char *)0xfb1a)	/* 共阳模式显示数据  - Mode - Data*/
#define COM3_DAH (*(volatile __xdata unsigned char *)0xfb1b)	/* 共阳模式显示数据  - Mode - Data*/
#define COM4_DAH (*(volatile __xdata unsigned char *)0xfb1c)	/* 共阳模式显示数据  - Mode - Data*/
#define COM5_DAH (*(volatile __xdata unsigned char *)0xfb1d)	/* 共阳模式显示数据  - Mode - Data*/
#define COM6_DAH (*(volatile __xdata unsigned char *)0xfb1e)	/* 共阳模式显示数据  - Mode - Data*/
#define COM7_DAH (*(volatile __xdata unsigned char *)0xfb1f)	/* 共阳模式显示数据  - Mode - Data*/

#define COM0_DCL (*(volatile __xdata unsigned char *)0xfb20)	/* 共阴模式显示数据  - Mode - Data*/
#define COM1_DCL (*(volatile __xdata unsigned char *)0xfb21)	/* 共阴模式显示数据  - Mode - Data*/
#define COM2_DCL (*(volatile __xdata unsigned char *)0xfb22)	/* 共阴模式显示数据  - Mode - Data*/
#define COM3_DCL (*(volatile __xdata unsigned char *)0xfb23)	/* 共阴模式显示数据  - Mode - Data*/
#define COM4_DCL (*(volatile __xdata unsigned char *)0xfb24)	/* 共阴模式显示数据  - Mode - Data*/
#define COM5_DCL (*(volatile __xdata unsigned char *)0xfb25)	/* 共阴模式显示数据  - Mode - Data*/
#define COM6_DCL (*(volatile __xdata unsigned char *)0xfb26)	/* 共阴模式显示数据  - Mode - Data*/
#define COM7_DCL (*(volatile __xdata unsigned char *)0xfb27)	/* 共阴模式显示数据  - Mode - Data*/
#define COM0_DCH (*(volatile __xdata unsigned char *)0xfb28)	/* 共阴模式显示数据  - Mode - Data*/
#define COM1_DCH (*(volatile __xdata unsigned char *)0xfb29)	/* 共阴模式显示数据  - Mode - Data*/
#define COM2_DCH (*(volatile __xdata unsigned char *)0xfb2a)	/* 共阴模式显示数据  - Mode - Data*/
#define COM3_DCH (*(volatile __xdata unsigned char *)0xfb2b)	/* 共阴模式显示数据  - Mode - Data*/
#define COM4_DCH (*(volatile __xdata unsigned char *)0xfb2c)	/* 共阴模式显示数据  - Mode - Data*/
#define COM5_DCH (*(volatile __xdata unsigned char *)0xfb2d)	/* 共阴模式显示数据  - Mode - Data*/
#define COM6_DCH (*(volatile __xdata unsigned char *)0xfb2e)	/* 共阴模式显示数据  - Mode - Data*/
#define COM7_DCH (*(volatile __xdata unsigned char *)0xfb2f)	/* 共阴模式显示数据  - Mode - Data*/

