aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
#define TSCHEN (*(volatile __xdata unsigned int *)0xfb40)	/* 触摸按键使能寄存器  - Enable*/
#define TSCFG (*(volatile __xdata unsigned int *)0xfb42)	/* 触摸按键配置寄存器1  - Configuration*/
#define TSSTA (*(volatile __xdata unsigned int *)0xfb46)	/* 触摸按键状态寄存器1  - Status*/
#define TSDAT (*(volatile __xdata unsigned int *)0xfb49)	/* 触摸按键数据  - Data*/
#define TSTH00 (*(volatile __xdata unsigned int *)0xfb50)	/* 触摸按键0门槛值高字节 */
#define TSTH01 (*(volatile __xdata unsigned int *)0xfb52)	/* 触摸按键1门槛值高字节 */
#define TSTH02 (*(volatile __xdata unsigned int *)0xfb54)	/* 触摸按键2门槛值高字节 */
#define TSTH03 (*(volatile __xdata unsigned int *)0xfb56)	/* 触摸按键3门槛值高字节 */
#define TSTH04 (*(volatile __xdata unsigned int *)0xfb58)	/* 触摸按键4门槛值高字节 */
#define TSTH05 (*(volatile __xdata unsigned int *)0xfb5a)	/* 触摸按键5门槛值高字节 */
#define TSTH06 (*(volatile __xdata unsigned int *)0xfb5c)	/* 触摸按键6门槛值高字节 */
#define TSTH07 (*(volatile __xdata unsigned int *)0xfb5e)	/* 触摸按键7门槛值高字节 */
#define TSTH08 (*(volatile __xdata unsigned int *)0xfb60)	/* 触摸按键8门槛值高字节 */
#define TSTH09 (*(volatile __xdata unsigned int *)0xfb62)	/* 触摸按键9门槛值高字节 */
#define TSTH10 (*(volatile __xdata unsigned int *)0xfb64)	/* 触摸按键10门槛值高字节 */
#define TSTH11 (*(volatile __xdata unsigned int *)0xfb66)	/* 触摸按键11门槛值高字节 */
#define TSTH12 (*(volatile __xdata unsigned int *)0xfb68)	/* 触摸按键12门槛值高字节 */
#define TSTH13 (*(volatile __xdata unsigned int *)0xfb6a)	/* 触摸按键13门槛值高字节 */
#define TSTH14 (*(volatile __xdata unsigned int *)0xfb6c)	/* 触摸按键14门槛值高字节 */
#define TSTH15 (*(volatile __xdata unsigned int *)0xfb6e)	/* 触摸按键15门槛值高字节 */

#define TSCHEN1 (*(volatile __xdata unsigned char *)0xfb40)	/* 触摸按键使能寄存器1  - Enable*/
#define TSCHEN2 (*(volatile __xdata unsigned char *)0xfb41)	/* 触摸按键使能寄存器2  - Enable*/
#define TSCFG1 (*(volatile __xdata unsigned char *)0xfb42)	/* 触摸按键配置寄存器1  - Configuration*/
#define TSCFG2 (*(volatile __xdata unsigned char *)0xfb43)	/* 触摸按键配置寄存器2  - Configuration*/
#define TSWUTC (*(volatile __xdata unsigned char *)0xfb44)	/* 触摸按键唤醒控制寄存器  - Control*/
#define TSCTRL (*(volatile __xdata unsigned char *)0xfb45)	/* 触摸按键控制寄存器   - Control*/
#define TSSTA1 (*(volatile __xdata unsigned char *)0xfb46)	/* 触摸按键状态寄存器1  - Status*/
#define TSSTA2 (*(volatile __xdata unsigned char *)0xfb47)	/* 触摸按键状态寄存器2  - Status*/

#define TSRT (*(volatile __xdata unsigned char *)0xfb48)	/* 触摸按键时间控制寄存器  - Control*/
#define TSDATH (*(volatile __xdata unsigned char *)0xfb49)	/* 触摸按键数据高字节  - Data*/
#define TSDATL (*(volatile __xdata unsigned char *)0xfb4a)	/* 触摸按键数据低字节  - Data*/

#define TSTH00H (*(volatile __xdata unsigned char *)0xfb50)	/* 触摸按键0门槛值高字节 */
#define TSTH00L (*(volatile __xdata unsigned char *)0xfb51)	/* 触摸按键0门槛值低字节 */
#define TSTH01H (*(volatile __xdata unsigned char *)0xfb52)	/* 触摸按键1门槛值高字节 */
#define TSTH01L (*(volatile __xdata unsigned char *)0xfb53)	/* 触摸按键1门槛值低字节 */
#define TSTH02H (*(volatile __xdata unsigned char *)0xfb54)	/* 触摸按键2门槛值高字节 */
#define TSTH02L (*(volatile __xdata unsigned char *)0xfb55)	/* 触摸按键2门槛值低字节 */
#define TSTH03H (*(volatile __xdata unsigned char *)0xfb56)	/* 触摸按键3门槛值高字节 */
#define TSTH03L (*(volatile __xdata unsigned char *)0xfb57)	/* 触摸按键3门槛值低字节 */
#define TSTH04H (*(volatile __xdata unsigned char *)0xfb58)	/* 触摸按键4门槛值高字节 */
#define TSTH04L (*(volatile __xdata unsigned char *)0xfb59)	/* 触摸按键4门槛值低字节 */
#define TSTH05H (*(volatile __xdata unsigned char *)0xfb5a)	/* 触摸按键5门槛值高字节 */
#define TSTH05L (*(volatile __xdata unsigned char *)0xfb5b)	/* 触摸按键5门槛值低字节 */
#define TSTH06H (*(volatile __xdata unsigned char *)0xfb5c)	/* 触摸按键6门槛值高字节 */
#define TSTH06L (*(volatile __xdata unsigned char *)0xfb5d)	/* 触摸按键6门槛值低字节 */
#define TSTH07H (*(volatile __xdata unsigned char *)0xfb5e)	/* 触摸按键7门槛值高字节 */
#define TSTH07L (*(volatile __xdata unsigned char *)0xfb5f)	/* 触摸按键7门槛值低字节 */
#define TSTH08H (*(volatile __xdata unsigned char *)0xfb60)	/* 触摸按键8门槛值高字节 */
#define TSTH08L (*(volatile __xdata unsigned char *)0xfb61)	/* 触摸按键8门槛值低字节 */
#define TSTH09H (*(volatile __xdata unsigned char *)0xfb62)	/* 触摸按键9门槛值高字节 */
#define TSTH09L (*(volatile __xdata unsigned char *)0xfb63)	/* 触摸按键9门槛值低字节 */
#define TSTH10H (*(volatile __xdata unsigned char *)0xfb64)	/* 触摸按键10门槛值高字节 */
#define TSTH10L (*(volatile __xdata unsigned char *)0xfb65)	/* 触摸按键10门槛值低字节 */
#define TSTH11H (*(volatile __xdata unsigned char *)0xfb66)	/* 触摸按键11门槛值高字节 */
#define TSTH11L (*(volatile __xdata unsigned char *)0xfb67)	/* 触摸按键11门槛值低字节 */
#define TSTH12H (*(volatile __xdata unsigned char *)0xfb68)	/* 触摸按键12门槛值高字节 */
#define TSTH12L (*(volatile __xdata unsigned char *)0xfb69)	/* 触摸按键12门槛值低字节 */
#define TSTH13H (*(volatile __xdata unsigned char *)0xfb6a)	/* 触摸按键13门槛值高字节 */
#define TSTH13L (*(volatile __xdata unsigned char *)0xfb6b)	/* 触摸按键13门槛值低字节 */
#define TSTH14H (*(volatile __xdata unsigned char *)0xfb6c)	/* 触摸按键14门槛值高字节 */
#define TSTH14L (*(volatile __xdata unsigned char *)0xfb6d)	/* 触摸按键14门槛值低字节 */
#define TSTH15H (*(volatile __xdata unsigned char *)0xfb6e)	/* 触摸按键15门槛值高字节 */
#define TSTH15L (*(volatile __xdata unsigned char *)0xfb6f)	/* 触摸按键15门槛值低字节 */


//=============================================================================================================

#define	EAXSFR()		P_SW2 |=  0x80		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
#define	EAXRAM()		P_SW2 &= ~0x80		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */

#define	I2C_USE_P15P14()	P_SW2 &= ~0x30						/* 将I2C切换到P1.5(SCL) P1.4(SDA)(上电默认). - Inter-Integrated Circuit*/
#define	I2C_USE_P25P24()	P_SW2  = (P_SW2 & ~0x30) | 0x10		/* 将I2C切换到P2.5(SCL) P2.4(SDA). - Inter-Integrated Circuit*/
#define	I2C_USE_P32P33()	P_SW2 |= 0x30						/* 将I2C切换到P3.2(SCL) P3.3(SDA). - Inter-Integrated Circuit*/

#define	MainFosc_IRC24M()	CKSEL = (CKSEL & ~0x03)			/* 选择内部24MHZ时钟  - Clock*/
#define	MainFosc_XTAL()		CKSEL = (CKSEL & ~0x03) | 0x01	/* 选择外部晶振或时钟  - Clock*/
#define	EXT_CLOCK()			XOSCCR = 0x80					/* 选择外部时钟  - Clock*/
#define	EXT_CRYSTAL()		XOSCCR = 0xC0					/* 选择外部晶振 */
#define	MainFosc_IRC32K()	CKSEL =  CKSEL | 0x03			/* 选择内部32K时钟  - Clock*/
#define	MCLKO_None()		MCLKOCR = 0						/* 主时钟不输出 	     - Clock*/
#define	MCLKO54_DIV(n)		MCLKOCR = n						/* 主时钟从P5.4分频输出 0~127  - Clock*/
#define	MCLKO16_DIV(n)		MCLKOCR = n | 0x80				/* 主时钟从P1.6分频输出 0~127  - Clock*/


/*  BIT Registers  */
/*  PSW   */
__sbit __at(0xD7) CY;
__sbit __at(0xD6) AC;
__sbit __at(0xD5) F0;
__sbit __at(0xD4) RS1;
__sbit __at(0xD3) RS0;
__sbit __at(0xD2) OV;
__sbit __at(0xD1) F1;
__sbit __at(0xD0) P;

