aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
/*  TCON  */
__sbit __at(0x8F) TF1;	//定时器1溢出中断标志位 - Timer - Interrupt - Flag
__sbit __at(0x8E) TR1;	//定时器1运行控制位 - Timer - Control
__sbit __at(0x8D) TF0;	//定时器0溢出中断标志位 - Timer - Interrupt - Flag
__sbit __at(0x8C) TR0;	//定时器0运行控制位 - Timer - Control
__sbit __at(0x8B) IE1;	//外中断1标志位 - Interrupt - Flag
__sbit __at(0x8A) IT1;	//外中断1信号方式控制位，1：下降沿中断，0：上升下降均中断。 - Interrupt - Control
__sbit __at(0x89) IE0;	//外中断0标志位 - Interrupt - Flag
__sbit __at(0x88) IT0;	//外中断0信号方式控制位，1：下降沿中断，0：上升下降均中断。 - Interrupt - Control

/*  P0  */
__sbit __at(0x80) P00;
__sbit __at(0x81) P01;
__sbit __at(0x82) P02;
__sbit __at(0x83) P03;
__sbit __at(0x84) P04;
__sbit __at(0x85) P05;
__sbit __at(0x86) P06;
__sbit __at(0x87) P07;

/*  P1  */
__sbit __at(0x90) P10;
__sbit __at(0x91) P11;
__sbit __at(0x92) P12;
__sbit __at(0x93) P13;
__sbit __at(0x94) P14;
__sbit __at(0x95) P15;
__sbit __at(0x96) P16;
__sbit __at(0x97) P17;

/*  P2  */
__sbit __at(0xA0) P20;
__sbit __at(0xA1) P21;
__sbit __at(0xA2) P22;
__sbit __at(0xA3) P23;
__sbit __at(0xA4) P24;
__sbit __at(0xA5) P25;
__sbit __at(0xA6) P26;
__sbit __at(0xA7) P27;

/*  P3  */
__sbit __at(0xB0) P30;
__sbit __at(0xB1) P31;
__sbit __at(0xB2) P32;
__sbit __at(0xB3) P33;
__sbit __at(0xB4) P34;
__sbit __at(0xB5) P35;
__sbit __at(0xB6) P36;
__sbit __at(0xB7) P37;

/*  P4  */
__sbit __at(0xC0) P40;
__sbit __at(0xC1) P41;
__sbit __at(0xC2) P42;
__sbit __at(0xC3) P43;
__sbit __at(0xC4) P44;
__sbit __at(0xC5) P45;
__sbit __at(0xC6) P46;
__sbit __at(0xC7) P47;

/*  P5  */
__sbit __at(0xC8) P50;
__sbit __at(0xC9) P51;
__sbit __at(0xCA) P52;
__sbit __at(0xCB) P53;
__sbit __at(0xCC) P54;
__sbit __at(0xCD) P55;
__sbit __at(0xCE) P56;
__sbit __at(0xCF) P57;

/*  P6  */
__sbit __at(0xE8) P60;
__sbit __at(0xE9) P61;
__sbit __at(0xEA) P62;
__sbit __at(0xEB) P63;
__sbit __at(0xEC) P64;
__sbit __at(0xED) P65;
__sbit __at(0xEE) P66;
__sbit __at(0xEF) P67;

/*  P7  */
__sbit __at(0xF8) P70;
__sbit __at(0xF9) P71;
__sbit __at(0xFA) P72;
__sbit __at(0xFB) P73;
__sbit __at(0xFC) P74;
__sbit __at(0xFD) P75;
__sbit __at(0xFE) P76;
__sbit __at(0xFF) P77;

__sbit __at(0x90) RXD2;
__sbit __at(0x91) TXD2;
__sbit __at(0x92) ECI;
__sbit __at(0x91) CCP0;
__sbit __at(0x90) CCP1;
__sbit __at(0xB7) CCP2;
__sbit __at(0xB4) ECI_2;
__sbit __at(0xB5) CCP0_2;
__sbit __at(0xB6) CCP1_2;
__sbit __at(0xB7) CCP2_2;

__sbit __at(0x92) SPI_SS;
__sbit __at(0x93) SPI_MOSI;
__sbit __at(0x94) SPI_MISO;
__sbit __at(0x95) SPI_SCLK;

__sbit __at(0xB5) SPI_SS_4;
__sbit __at(0xB4) SPI_MOSI_4;
__sbit __at(0xB3) SPI_MISO_4;
__sbit __at(0xB2) SPI_SCLK_4;

__sbit __at(0xB0) RXD;
__sbit __at(0xB1) TXD;
__sbit __at(0xB2) INT0;
__sbit __at(0xB3) INT1;
__sbit __at(0xB4) T0;
__sbit __at(0xB5) T1;

__sbit __at(0xB6) INT2;
__sbit __at(0xB7) INT3;
__sbit __at(0xB0) INT4;

__sbit __at(0xB5) T0CLKOUT;
__sbit __at(0xB4) T1CLKOUT;


/*  SCON  */
__sbit __at(0x9F) SM0;	//SM0/FE		SM0 SM1 = 00 ~ 11: 方式0~3
__sbit __at(0x9E) SM1;	//
__sbit __at(0x9D) SM2;	//多机通讯
__sbit __at(0x9C) REN;	//接收允许
__sbit __at(0x9B) TB8;	//发送数据第8位 - Data
__sbit __at(0x9A) RB8;	//接收数据第8位 - Data
__sbit __at(0x99) TI;	//发送中断标志位 - Interrupt - Flag
__sbit __at(0x98) RI;	//接收中断标志位 - Interrupt - Flag

/*  IE   */
__sbit __at(0xAF) EA;	//中断允许总控制位 - Interrupt - Control
__sbit __at(0xAE) ELVD;	//低压监测中断允许位 - Interrupt
__sbit __at(0xAD) EADC;	//ADC 中断 允许位 - Interrupt - Analog to Digital Converter
__sbit __at(0xAC) ES;	//串行中断 允许控制位 - Interrupt - Control
__sbit __at(0xAB) ET1;	//定时中断1允许控制位 - Interrupt - Control
__sbit __at(0xAA) EX1;	//外部中断1允许控制位 - Interrupt - Control
__sbit __at(0xA9) ET0;	//定时中断0允许控制位 - Interrupt - Control
__sbit __at(0xA8) EX0;	//外部中断0允许控制位 - Interrupt - Control

__sbit __at(0xE0) ACC0;
__sbit __at(0xE1) ACC1;
__sbit __at(0xE2) ACC2;
__sbit __at(0xE3) ACC3;
__sbit __at(0xE4) ACC4;
__sbit __at(0xE5) ACC5;
__sbit __at(0xE6) ACC6;
__sbit __at(0xE7) ACC7;

__sbit __at(0xF0) B0;
__sbit __at(0xF1) B1;
__sbit __at(0xF2) B2;
__sbit __at(0xF3) B3;
__sbit __at(0xF4) B4;
__sbit __at(0xF5) B5;
__sbit __at(0xF6) B6;
__sbit __at(0xF7) B7;

//                                     7    6    5    4    3     2       1       0      Reset Value
//INT_CLKO:  中断与时钟输出控制寄存器  -   EX4  EX3  EX2   -   T2CLKO  T1CLKO  T0CLKO    0000,0000 - Interrupt - Clock - Control
#define	INT4_Enable()	INT_CLKO |= (1 << 6)
#define	INT3_Enable()	INT_CLKO |= (1 << 5)	
#define	INT2_Enable()	INT_CLKO |= (1 << 4)	
#define	INT1_Enable()	EX1 = 1
#define	INT0_Enable()	EX0 = 1

#define	INT4_Disable()	INT_CLKO &= ~(1 << 6)
#define	INT3_Disable()	INT_CLKO &= ~(1 << 5)	
#define	INT2_Disable()	INT_CLKO &= ~(1 << 4)	
#define	INT1_Disable()	EX1 = 0
#define	INT0_Disable()	EX0 = 0

//                               7    6       5       4      3    2     1     0      Reset Value
//AUXINTIF:  辅助中断标志寄存器  -  INT4IF  INT3IF  INT2IF   -   T4IF  T3IF  T2IF    0000,0000 - Interrupt - Flag
#define	INT4IF	0x40
#define	INT3IF	0x20
#define	INT2IF	0x10
#define	T4IF	0x04
#define	T3IF	0x02
#define	T2IF	0x01

#define	INT4_Clear()	AUXINTIF &= ~INT4IF		/* 清除外中断4标志位  - Interrupt - Flag*/
#define	INT3_Clear()	AUXINTIF &= ~INT3IF		/* 清除外中断3标志位  - Interrupt - Flag*/
#define	INT2_Clear()	AUXINTIF &= ~INT2IF		/* 清除外中断2标志位  - Interrupt - Flag*/
#define	INT1_Clear()	IE1 = 0					/* 清除外中断1标志位  - Interrupt - Flag*/
#define	INT0_Clear()	IE0 = 0					/* 清除外中断0标志位  - Interrupt - Flag*/

#define	INT0_Fall()		IT0 = 1		/* INT0 下降沿中断            - Interrupt*/
#define	INT0_RiseFall()	IT0 = 0		/* INT0 下降沿上升沿均中断    - Interrupt*/
#define	INT1_Fall()		IT1 = 1		/* INT1 下降沿中断            - Interrupt*/
#define	INT1_RiseFall()	IT0 = 0		/* INT1 下降沿上升沿均中断    - Interrupt*/


//							7     6     5    4    3    2    1     0    Reset Value
//__sfr __at(0xAF) IE2;		-     -     -    -    -    -   ESPI  ES2   0000,0000B	//Auxiliary Interrupt    - Serial Peripheral Interface
#define		SPI_INT_ENABLE()		IE2 |=  2	/* 允许SPI中断		 - Interrupt - Serial Peripheral Interface*/
#define		SPI_INT_DISABLE()		IE2 &= ~2	/* 允许SPI中断		 - Interrupt - Serial Peripheral Interface*/
#define		UART2_INT_ENABLE()		IE2 |=  1	/* 允许串口2中断	 - UART/Serial - Interrupt*/
#define		UART2_INT_DISABLE()		IE2 &= ~1	/* 允许串口2中断	 - UART/Serial - Interrupt*/

//                                          7     6     5    4    3    2    1    0    Reset Value
//__sfr __at(0xB8) IP; //中断优先级低位      PPCA  PLVD  PADC  PS   PT1  PX1  PT0  PX0   0000,0000 - Interrupt - Analog to Digital Converter
//--------
__sbit __at(0xBF) PPCA;	//PCA 模块中断优先级 - Interrupt
__sbit __at(0xBE) PLVD;	//低压监测中断优先级 - Interrupt
__sbit __at(0xBD) PADC;	//ADC 中断优先级 - Interrupt - Analog to Digital Converter
__sbit __at(0xBC) PS;	//串行中断0优先级设定位 - Interrupt
__sbit __at(0xBB) PT1;	//定时中断1优先级设定位 - Interrupt
__sbit __at(0xBA) PX1;	//外部中断1优先级设定位 - Interrupt
__sbit __at(0xB9) PT0;	//定时中断0优先级设定位 - Interrupt
__sbit __at(0xB8) PX0;	//外部中断0优先级设定位 - Interrupt

