aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
//						  7     6      5    4     3      2    1     0     Reset Value
//__sfr __at(0x87) PCON;	SMOD  SMOD0  LVDF  POF   GF1    GF0   PD   IDL    0001,0000	 //Power Control 
//SMOD		//串口双倍速 - UART/Serial
//SMOD0
#define		LVDF		(1<<5)	/* P4.6低压检测标志  - Flag*/
//POF
//GF1
//GF0
//#define 	D_PD		2		/* set 1, power down mode */
//#define 	D_IDLE		1		/* set 1, idle mode */
#define		MCU_IDLE()			PCON |= 1	/* MCU 进入 IDLE 模式  - Mode*/
#define		MCU_POWER_DOWN()	PCON |= 2	/* MCU 进入 睡眠 模式  - Mode*/


//__sfr __at(0xC5) ISP_CMD;
#define		ISP_STANDBY()	ISP_CMD = 0		/* ISP空闲命令（禁止） - Disable*/
#define		ISP_READ()		ISP_CMD = 1		/* ISP读出命令		*/
#define		ISP_WRITE()		ISP_CMD = 2		/* ISP写入命令		*/
#define		ISP_ERASE()		ISP_CMD = 3		/* ISP擦除命令		*/

//__sfr __at(0xC6) ISP_TRIG;
#define 	ISP_TRIG()	ISP_TRIG = 0x5A,	ISP_TRIG = 0xA5		/* ISP触发命令 */

//							  7    6    5      4    3    2    1     0    Reset Value
//__sfr __at(0xC7) IAP_CONTR;		IAPEN SWBS SWRST CFAIL  -    -    -     -    0000,x000	//IAP Control Register
#define ISP_EN			(1<<7)
#define ISP_SWBS		(1<<6)
#define ISP_SWRST		(1<<5)
#define ISP_CMD_FAIL	(1<<4)


/* ADC Register  - Analog to Digital Converter*/
//								7       6      5       4         3      2    1    0   Reset Value
//__sfr __at(0xBC) ADC_CONTR;		ADC_POWER SPEED1 SPEED0 ADC_FLAG ADC_START CHS2 CHS1 CHS0 0000,0000	/* AD 转换控制寄存器 */  - Control - Analog to Digital Converter
//__sfr __at(0xBD) ADC_RES;		ADCV.9 ADCV.8 ADCV.7 ADCV.6 ADCV.5 ADCV.4 ADCV.3 ADCV.2	  0000,0000	/* A/D 转换结果高8位 */  - Analog to Digital Converter
//__sfr __at(0xBE) ADC_RESL;												  ADCV.1 ADCV.0	  0000,0000	/* A/D 转换结果低2位 */ - Analog to Digital Converter
//__sfr __at(0xBC) ADC_CONTR;	//直接用MOV操作，不要用与或 - Analog to Digital Converter


//__sfr __at(0xCE) SPCTL;	SPI控制寄存器 - Control - Serial Peripheral Interface
//   7       6       5       4       3       2       1       0    	Reset Value
//	SSIG	SPEN	DORD	MSTR	CPOL	CPHA	SPR1	SPR0		0x00

#define	SPI_SSIG_None()		SPCTL |=  (1<<7)		/* 1: 忽略SS脚	*/
#define	SPI_SSIG_Enable()	SPCTL &= ~(1<<7)		/* 0: SS脚用于决定主从机	*/
#define	SPI_Enable()		SPCTL |=  (1<<6)		/* 1: 允许SPI	 - Serial Peripheral Interface*/
#define	SPI_Disable()		SPCTL &= ~(1<<6)		/* 0: 禁止SPI	 - Disable - Serial Peripheral Interface*/
#define	SPI_LSB_First()		SPCTL |=  (1<<5)		/* 1: LSB先发	*/
#define	SPI_MSB_First()		SPCTL &= ~(1<<5)		/* 0: MSB先发	*/
#define	SPI_Master()		SPCTL |=  (1<<4)		/* 1: 设为主机	*/
#define	SPI_Slave()			SPCTL &= ~(1<<4)		/* 0: 设为从机	*/
#define	SPI_SCLK_NormalH()	SPCTL |=  (1<<3)		/* 1: 空闲时SCLK为高电平	*/
#define	SPI_SCLK_NormalL()	SPCTL &= ~(1<<3)		/* 0: 空闲时SCLK为低电平	*/
#define	SPI_PhaseH()		SPCTL |=  (1<<2)		/* 1: 	*/
#define	SPI_PhaseL()		SPCTL &= ~(1<<2)		/* 0: 	*/
#define	SPI_Speed(n)		SPCTL = (SPCTL & ~3) | (n)	/*设置速度, 0 -- fosc/4, 1 -- fosc/8, 2 -- fosc/16, 3 -- fosc/32	*/

//__sfr __at(0xCF) SPDAT; //SPI Data Register                                                     0000,0000 - Serial Peripheral Interface
//__sfr __at(0xCD) SPSTAT;	//SPI状态寄存器 - Status - Serial Peripheral Interface
//   7       6      5   4   3   2   1   0    	Reset Value
//	SPIF	WCOL	-	-	-	-	-	- - Serial Peripheral Interface
#define	SPIF	0x80		/* SPI传输完成标志。写入1清0。 - Flag - Serial Peripheral Interface*/
#define	WCOL	0x40		/* SPI写冲突标志。写入1清0。   - Flag - Serial Peripheral Interface*/

#define		SPI_USE_P12P13P14P15()	P_SW1 &= ~0x0c					/* 将SPI切换到P12(SS) P13(MOSI) P14(MISO) P15(SCLK)(上电默认)。 - Serial Peripheral Interface*/
#define		SPI_USE_P22P23P24P25()	P_SW1 = (P_SW1 & ~0x0c) | 0x04	/* 将SPI切换到P22(SS) P23(MOSI) P24(MISO) P25(SCLK)。 - Serial Peripheral Interface*/
#define		SPI_USE_P35P34P33P32()	P_SW1 =  P_SW1 | 0x0C			/* 将SPI切换到P35(SS) P34(MOSI) P33(MISO) P32(SCLK)。 - Serial Peripheral Interface*/


/*
;PCA_PWMn:    7       6     5   4   3   2     1       0
;			EBSn_1	EBSn_0	-	-	-	-	EPCnH	EPCnL
;B5-B2:		保留
;B1(EPCnH):	在PWM模式下，与CCAPnH组成9位数。
;B0(EPCnL):	在PWM模式下，与CCAPnL组成9位数。
 - Mode - Pulse Width Modulation*/
#define		PWM0_NORMAL()	PCA_PWM0 &= ~2									/* PWM0正常输出(默认)	 - Pulse Width Modulation*/
#define		PWM0_OUT_0()	PCA_PWM0 |= 0x3f, CCAP0H = 0xff, CCAP0L = 0xff	/* PWM0一直输出0		 - Pulse Width Modulation*/
#define		PWM0_OUT_1()	PCA_PWM0 &= 0xc0, CCAP0H = 0,    CCAP0L = 0		/* PWM0一直输出1		 - Pulse Width Modulation*/

#define		PWM1_NORMAL()	PCA_PWM1 &= ~2									/* PWM1正常输出(默认)	 - Pulse Width Modulation*/
#define		PWM1_OUT_0()	PCA_PWM1 |= 0x3f, CCAP1H = 0xff, CCAP1L = 0xff	/* PWM1一直输出0		 - Pulse Width Modulation*/
#define		PWM1_OUT_1()	PCA_PWM1 &= 0xc0, CCAP1H = 0,    CCAP1L = 0		/* PWM1一直输出1		 - Pulse Width Modulation*/

#define		PWM2_NORMAL()	PCA_PWM2 &= ~2									/* PWM2正常输出(默认)	 - Pulse Width Modulation*/
#define		PWM2_OUT_0()	PCA_PWM2 |= 0x3f, CCAP2H = 0xff, CCAP2L = 0xff	/* PWM2一直输出0		 - Pulse Width Modulation*/
#define		PWM2_OUT_1()	PCA_PWM2 &= 0xc0, CCAP2H = 0,    CCAP2L = 0		/* PWM2一直输出1		 - Pulse Width Modulation*/

//						7     6     5     4     3     2     1     0     Reset Value
//__sfr __at(0xD8) CCON;	CF    CR    -     -    CCF3  CCF2  CCF1  CCF0   00xx,xx00	//PCA 控制寄存器。 - Control
__sbit __at(0xD8) CCF0;	/* PCA 模块0中断标志，由硬件置位，必须由软件清0。	 - Interrupt - Flag*/
__sbit __at(0xD9) CCF1;	/* PCA 模块1中断标志，由硬件置位，必须由软件清0。	 - Interrupt - Flag*/
__sbit __at(0xDA) CCF2;	/* PCA 模块2中断标志，由硬件置位，必须由软件清0。	 - Interrupt - Flag*/
__sbit __at(0xDE) CR;	/* 1: 允许PCA计数器计数，必须由软件清0。 - Counter*/
__sbit __at(0xDF) CF;	/* PCA计数器溢出（CH，CL由FFFFH变为0000H）标志。PCA计数器溢出后由硬件置位，必须由软件清0。 - Flag - Counter*/

//					 7     6     5     4     3     2     1     0    Reset Value
//__sfr __at(0xD9) CMOD;	CIDL   -     -     -   CPS2   CPS1  CPS0  ECF   0xxx,0000	//PCA 工作模式寄存器。 - Mode
#define PCA_IDLE_OFF()		CMOD |=  (1<<7)				/* IDLE状态PCA停止计数。	 - Status*/
#define PCA_IDLE_ON()		CMOD &= ~(1<<7)				/* IDLE状态PCA继续计数。	 - Status*/
#define PCA_CLK_12T()		CMOD &= ~0x0E				/* PCA计数脉冲选择 fosc/12	*/
#define PCA_CLK_2T()		CMOD = (CMOD & ~0x0E) + 2	/* PCA计数脉冲选择 fosc/2	*/
#define PCA_CLK_T0()		CMOD = (CMOD & ~0x0E) + 4	/* PCA计数脉冲选择Timer0中断，Timer0可通过AUXR寄存器设置成工作在12T或1T模式。	 - Interrupt - Mode*/
#define PCA_CLK_ECI()		CMOD = (CMOD & ~0x0E) + 6	/* PCA计数脉冲选择从ECI/P3.4脚输入的外部时钟，最大 fosc/2。	 - Clock*/
#define PCA_CLK_1T()		CMOD = (CMOD & ~0x0E) + 8	/* PCA计数脉冲选择 Fosc	*/
#define PCA_CLK_4T()		CMOD = (CMOD & ~0x0E) + 10	/* PCA计数脉冲选择 Fosc/4	*/
#define PCA_CLK_6T()		CMOD = (CMOD & ~0x0E) + 12	/* PCA计数脉冲选择 Fosc/6	*/
#define PCA_CLK_8T()		CMOD = (CMOD & ~0x0E) + 14	/* PCA计数脉冲选择 Fosc/8	*/
#define PCA_INT_ENABLE()	CMOD |=  1					/* PCA计数器溢出中断允许位，1---允许CF（CCON.7）产生中断。	 - Interrupt - Counter*/
#define PCA_INT_DISABLE()	CMOD &= ~1					/* PCA计数器溢出中断禁止。	 - Interrupt - Disable - Counter*/

