aerror2/keil51_to_sdcc/sdcc_src/STC8Gxxx.h
//					    7      6       5        4       3       2       1      0    Reset Value
//__sfr __at(0xA2) P_SW1;	  S1_S1  S1_S0  CCP_S1   CCP_S0  SPI_S1   SPI_S0    -     DPS   0100,0000	//Auxiliary Register 1 - Serial Peripheral Interface

#define		PCA_USE_P12P11P10P37()	P_SW1 &= ~0x30					/* 将PCA/PWM切换到P12(ECI) P11(CCP0) P10(CCP1) P37(CCP2)(上电默认)  - Pulse Width Modulation*/
#define		PCA_USE_P34P35P36P37()	P_SW1 = (P_SW1 & ~0x30) | 0x10	/* 将PCA/PWM切换到P34(ECI) P35(CCP0) P36(CCP1) P37(CCP2)  - Pulse Width Modulation*/
#define		PCA_USE_P24P25P26P27()	P_SW1 = (P_SW1 & ~0x30) | 0x20	/* 将PCA/PWM切换到P24(ECI) P25(CCP0) P26(CCP1) P27(CCP2)  - Pulse Width Modulation*/

/*									7     6       5       4     3     2     1     0     Reset Value
//__sfr __at(0xDA) CCAPM0;	PWM 寄存器  -   ECOM0  CCAPP0  CCAPN0  MAT0  TOG0  PWM0  ECCF0   x000,0000	//PCA 模块0 - Pulse Width Modulation
//__sfr __at(0xDB) CCAPM1;	PWM 寄存器  -   ECOM1  CCAPP1  CCAPN1  MAT1  TOG1  PWM1  ECCF1   x000,0000	//PCA 模块1 - Pulse Width Modulation
//__sfr __at(0xDC) CCAPM2;	PWM 寄存器  -   ECOM2  CCAPP2  CCAPN2  MAT2  TOG2  PWM2  ECCF2   x000,0000	//PCA 模块2 - Pulse Width Modulation
//__sfr __at(0xDD) CCAPM3;	PWM 寄存器  -   ECOM3  CCAPP3  CCAPN3  MAT3  TOG3  PWM3  ECCF3   x000,0000	//PCA 模块3 - Pulse Width Modulation
;ECOMn = 1:	允许比较功能。
;CAPPn = 1:	允许上升沿触发捕获功能。
;CAPNn = 1:	允许下降沿触发捕获功能。
;MATn  = 1:	当匹配情况发生时，允许CCON中的CCFn置位。
;TOGn  = 1:	当匹配情况发生时，CEXn将翻转。(CEX0/PCA0/PWM0/P3.7,CEX1/PCA1/PWM1/P3.5)
;PWMn  = 1:	将CEXn设置为PWM输出。
;ECCFn = 1:	允许CCON中的CCFn触发中断。
;ECOMn CAPPn CAPNn MATn TOGn PWMn ECCFn
;  0     0     0    0    0    0     0		00H	未启用任何功能。
;  x     1     0    0    0    0     x	 	20H	16位CEXn上升沿触发捕获功能。
;  x     0     1    0    0    0     x	 	10H	16位CEXn下降沿触发捕获功能。
;  x     1     1    0    0    0     x	 	30H	16位CEXn/PCAn边沿（上、下沿）触发捕获功能。
;  1     0     0    1    0    0     x	 	48H	16位软件定时器。
;  1     0     0    1    1    0     x	 	4CH	16位高速脉冲输出。
;  1     0     0    0    0    1     0		42H	8位PWM。无中断
;  1     1     0    0    0    1     1		63H	8位PWM。低变高可产生中断
;  1     0     1    0    0    1     1		53H	8位PWM。高变低可产生中断
;  1     1     1    0    0    1     1		73H	8位PWM。低变高或高变低均可产生中断
;*******************************************************************
;*******************************************************************/
#define		PCA0_none()				CCAPM0 = 0		/* PCA无功能 */
#define		PCA0_PWM(nbit)			CCAPM0 = 0x42,PCA_PWM0 = (PCA_PWM0 & 0x3f) | (nbit<<6)	/* 无中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA0_PWM_rise_int(nbit) CCAPM0 = 0x63,PCA_PWM0 = (PCA_PWM0 & 0x3f) | (nbit<<6)	/* 上升沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA0_PWM_fall_int(nbit) CCAPM0 = 0x53,PCA_PWM0 = (PCA_PWM0 & 0x3f) | (nbit<<6)	/* 下降沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA0_PWM_edge_int(nbit) CCAPM0 = 0x73,PCA_PWM0 = (PCA_PWM0 & 0x3f) | (nbit<<6)	/* 上升下降沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA0_capture_rise()		CCAPM0 = (0x20 + 1)		/* 上升沿捕获模式  - Mode - Capture*/
#define		PCA0_capture_fall()		CCAPM0 = (0x10 + 1)		/* 下降沿捕获模式  - Mode - Capture*/
#define		PCA0_capture_edge()		CCAPM0 = (0x30 + 1)		/* 上升下降沿捕获模式  - Mode - Capture*/
#define		PCA0_16bit_Timer()		CCAPM0 = (0x48 + 1)		/* 16位软件定时器模式  - Timer - Mode*/
#define		PCA0_High_PulseEnable()	CCAPM0 |= 0x04			/* 16位软件定时器 高速输出脉冲模式  - Timer - Mode*/

#define		PCA1_none()				CCAPM1 = 0		/* PCA无功能 */
#define		PCA1_PWM(nbit)			CCAPM1 = 0x42,PCA_PWM1 = (PCA_PWM1 & 0x3f) | (nbit<<6)	/* 无中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA1_PWM_rise_int(nbit) CCAPM1 = 0x63,PCA_PWM1 = (PCA_PWM1 & 0x3f) | (nbit<<6)	/* 上升沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA1_PWM_fall_int(nbit) CCAPM1 = 0x53,PCA_PWM1 = (PCA_PWM1 & 0x3f) | (nbit<<6)	/* 下降沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA1_PWM_edge_int(nbit) CCAPM1 = 0x73,PCA_PWM1 = (PCA_PWM1 & 0x3f) | (nbit<<6)	/* 上升下降沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA1_capture_rise()		CCAPM1 = (0x20 + 1)		/* 上升沿捕获模式  - Mode - Capture*/
#define		PCA1_capture_fall()		CCAPM1 = (0x10 + 1)		/* 下降沿捕获模式  - Mode - Capture*/
#define		PCA1_capture_edge()		CCAPM1 = (0x30 + 1)		/* 上升下降沿捕获模式  - Mode - Capture*/
#define		PCA1_16bit_Timer()		CCAPM1 = (0x48 + 1)		/* 16位软件定时器模式  - Timer - Mode*/
#define		PCA1_High_PulseEnable()	CCAPM1 |= 0x04			/* 16位软件定时器 高速输出脉冲模式  - Timer - Mode*/

#define		PCA2_none()				CCAPM2 = 0		/* PCA无功能 */
#define		PCA2_PWM(nbit)			CCAPM2 = 0x42,PCA_PWM2 = (PCA_PWM2 & 0x3f) | (nbit<<6)	/* 无中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA2_PWM_rise_int(nbit) CCAPM2 = 0x63,PCA_PWM2 = (PCA_PWM2 & 0x3f) | (nbit<<6)	/* 上升沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA2_PWM_fall_int(nbit) CCAPM2 = 0x53,PCA_PWM2 = (PCA_PWM2 & 0x3f) | (nbit<<6)	/* 下降沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA2_PWM_edge_int(nbit) CCAPM2 = 0x73,PCA_PWM2 = (PCA_PWM2 & 0x3f) | (nbit<<6)	/* 上升下降沿中断PWM模式(PWM长度)  - Interrupt - Mode - Pulse Width Modulation*/
#define		PCA2_capture_rise()		CCAPM2 = (0x20 + 1)		/* 上升沿捕获模式  - Mode - Capture*/
#define		PCA2_capture_fall()		CCAPM2 = (0x10 + 1)		/* 下降沿捕获模式  - Mode - Capture*/
#define		PCA2_capture_edge()		CCAPM2 = (0x30 + 1)		/* 上升下降沿捕获模式  - Mode - Capture*/
#define		PCA2_16bit_Timer()		CCAPM2 = (0x48 + 1)		/* 16位软件定时器模式  - Timer - Mode*/
#define		PCA2_High_PulseEnable()	CCAPM2 |= 0x04			/* 16位软件定时器 高速输出脉冲模式  - Timer - Mode*/

#define	PCA0			0
#define	PCA1			1
#define	PCA2			2
#define	PCA_Counter		4

/**********************************************************/
typedef 	unsigned char	u8;
typedef 	unsigned int	u16;
typedef 	unsigned long	u32;

/**********************************************************/
#define NOP1()  __asm NOP __endasm
#define NOP2() do{NOP1();NOP1();}while(0)
#define NOP3() do{NOP2();NOP1();}while(0)
#define NOP4() do{NOP3();NOP1();}while(0)
#define NOP5() do{NOP4();NOP1();}while(0)
#define NOP6() do{NOP5();NOP1();}while(0)
#define NOP7() do{NOP6();NOP1();}while(0)
#define NOP8() do{NOP7();NOP1();}while(0)
#define NOP9() do{NOP8();NOP1();}while(0)
#define NOP10() do{NOP9();NOP1();}while(0)
#define NOP11() do{NOP10();NOP1();}while(0)
#define NOP12() do{NOP11();NOP1();}while(0)
#define NOP13() do{NOP12();NOP1();}while(0)
#define NOP14() do{NOP13();NOP1();}while(0)
#define NOP15() do{NOP14();NOP1();}while(0)
#define NOP16() do{NOP15();NOP1();}while(0)
#define NOP17() do{NOP16();NOP1();}while(0)
#define NOP18() do{NOP17();NOP1();}while(0)
#define NOP19() do{NOP18();NOP1();}while(0)
#define NOP20() do{NOP19();NOP1();}while(0)
#define NOP21() do{NOP20();NOP1();}while(0)
#define NOP22() do{NOP21();NOP1();}while(0)
#define NOP23() do{NOP22();NOP1();}while(0)
#define NOP24() do{NOP23();NOP1();}while(0)
#define NOP25() do{NOP24();NOP1();}while(0)
#define NOP26() do{NOP25();NOP1();}while(0)
#define NOP27() do{NOP26();NOP1();}while(0)
#define NOP28() do{NOP27();NOP1();}while(0)
#define NOP29() do{NOP28();NOP1();}while(0)
#define NOP30() do{NOP29();NOP1();}while(0)
#define NOP31() do{NOP30();NOP1();}while(0)
#define NOP32() do{NOP31();NOP1();}while(0)
#define NOP33() do{NOP32();NOP1();}while(0)
#define NOP34() do{NOP33();NOP1();}while(0)
#define NOP35() do{NOP34();NOP1();}while(0)
#define NOP36() do{NOP35();NOP1();}while(0)
#define NOP37() do{NOP36();NOP1();}while(0)
#define NOP38() do{NOP37();NOP1();}while(0)
#define NOP39() do{NOP38();NOP1();}while(0)
#define NOP40() do{NOP39();NOP1();}while(0)
#define NOP(N)  NOP##N()


